package com.iiitm.android.zaika_e_gwalior;

import android.content.Context;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.support.v7.widget.Toolbar;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by Shivam on 12/19/2017.
 */

public class MedicalHindiActivity extends AppCompatActivity {

    public List<Adaptermedical> adaptermedicalList = new ArrayList<>();
    Context mContext;
    MovieAdaptermedical movieAdaptermedical;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main5);

        Toolbar toolbar= (Toolbar)findViewById(R.id.toolbar);
        toolbar.setTitle("मेडिकल");
        RecyclerView recyclerView = (RecyclerView) findViewById(R.id.recyclerView);
        RecyclerView.LayoutManager layoutManager = new LinearLayoutManager(this);
        recyclerView.setLayoutManager(layoutManager);
        mContext=this;
        movieAdaptermedical = new MovieAdaptermedical(adaptermedicalList,this);
        recyclerView.setAdapter(movieAdaptermedical);
        prepareMovieData();
    }

    private void prepareMovieData() {
        int[] covers = new int[]{
                R.drawable.apoloh,
                R.drawable.pariwarh,
                R.drawable.navjeevanh,
                R.drawable.kalyanmemorialh,
                R.drawable.shaharah,
                R.drawable.apex,
                R.drawable.bimr,
                R.drawable.charitbal,R.drawable.jaya,R.drawable.rkm,R.drawable.gcivilh,R.drawable.kamalraja,

        };


        Adaptermedical a = new Adaptermedical(covers[0],"अपोलो स्पेक्ट्रा","लश्कर, ग्वालियर","24 Hours",
                "अपोलो अस्पताल में शीतकालीन विशिष्टताओं की व्यापक श्रेणी में उत्कृष्टता प्रदान की जाती है जिसमें सामान्य और लैप्रोस्कोपिक सर्जरी, आर्थोपेडिक और स्पाइन, गायनोकोलॉजी, नेत्र विज्ञान शामिल हैं। इसके अलावा, अस्पताल नेफ्रोलॉजी, न्यूरोलॉजी, गैस्ट्रोएन्टरोलॉजी, कार्डियोलॉजी, दंत चिकित्सा, त्वचाविज्ञान, प्लास्टिक और कॉस्मेटिक सर्जरी जैसी विशेषताओं में व्यापक चिकित्सा देखभाल प्रदान की है।","लश्कर, ग्वालियर, मध्य प्रदेश 474002","07512454600","gfjhgfjhdegj");
        adaptermedicalList.add(a);

        a = new Adaptermedical(covers[1],"परिवार अस्पताल","लश्कर, ग्वालियर","24 Hours",
                "ग्वालियर में, परिवार अस्पताल रोगी देखभाल में मान्यता प्राप्त नाम है यह वर्ष 2008 में स्वीकार नहीं किया गया था। वे लश्कर में प्रसिद्ध अस्पतालों में से एक हैं। रोगी देखभाल में सर्वश्रेष्ठ पेश करने के लिए दृष्टि के साथ समर्थित और तकनीकी रूप से उन्नत स्वास्थ्य सेवा आईसीयू, सीसीयू, ट्रैमिया यूनिट, ईकोऑर्डीलॉजी सेक्शन, सर्जिकल आईसीयू, डायलेसीस यूनिटपोथलॉजी सेक्शन आदि से सुसज्जित है।","लश्कर, ग्वालियर, मध्य प्रदेश 474001","07514047000","gfjhgfjhdegj");
        adaptermedicalList.add(a);

        a = new Adaptermedical(covers[2],"नवजीवन अस्पताल","मोती महल रोड, ग्वालियर","24 hour",
                "ग्वालियर में, नवजीवन अस्पताल रोगी देखभाल में मान्यता प्राप्त नाम है। यह वर्ष 2007 में स्वीकार किया गया था। वे मोती महल रोड में प्रसिद्ध निजी अस्पतालों में से एक हैं। रोगी देखभाल में सर्वश्रेष्ठ पेश करने के लिए दृष्टि के साथ समर्थन और तकनीकी ऑक्सीजन की आपूर्ति और मल्टीपारा मॉनिटर, अल्ट्रा आधुनिक सर्जरी प्रक्रिया के लिए थिएटर, केंद्रीय ऑक्सीजन आपूर्ति के साथ आईसीयू और मल्टीपारा मॉनिटर, अल्ट्रा आधुनिक ऑपरेशन थिएटर के लिए आईसीयू के रूप में तकनीकी रूप से उन्नत स्वास्थ्य सेवा से लैस प्रक्रिया, डायलिसिस इकाई, मेडिकल स्टोर, 24 घंटे की आपातकालीन सुविधा, 24 घंटे हमारी एम्बुलेंस सेवा, कैशलेस और मेडिक्लेम बीमा सेवाएं, फिजियोथेरेपी आदि।","मोती महल रोड, ग्वालियर, मध्य प्रदेश 474002","07514024081","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[3], "कल्याण अस्पताल","लश्कर, ग्वालियर","24 Hour",
                "कल्याण मेमोरियल और केडीजे अस्पताल ग्वालियर में एक उन्नत अस्पताल है अस्पताल में अत्याधुनिक 100 बिस्तरों वाला सुपर स्पेशलिटी सुविधा है जिसमें नवीनतम मशीनों की पूरी श्रृंखला उपलब्ध है। यह पूरी तरह से लैस ओर्थो एंड ट्रॉमा यूनिट, एक आपातकालीन विभाग और आईसीसी है। विभिन्न सुविधाओं के लिए घंटों की घड़ी के स्नातक डॉक्टरों के साथ ड्यूटी समर्थित वेंटीलेटर, डीफ़िब्रिलेटर, मल्टीपरैमोनिटर और अन्य महत्वपूर्ण देखभाल उपकरण शामिल हैं।","लश्कर, ग्वालियर- 474001, अस्पताल रोड","07514006700","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[4],"सहारा अस्पताल","वसंत विहार, ग्वालियर","24 Hours",
               "ग्वालियर में, सहारा अस्पताल रोगी देखभाल में मान्यता प्राप्त नाम है यह वर्ष 2000 में स्वीकार नहीं किया गया था। वे प्रसिद्ध अस्पतालों में से एक हैं। रोगी देखभाल में सर्वश्रेष्ठ पेश करने के लिए दृष्टि के साथ समर्थित और तकनीकी रूप से उन्नत स्वास्थ्य सुविधाओं से सुसज्जित,","वसंत विहार, ग्वालियर, मध्य प्रदेश 474007","09926800870","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[5],"एपेक्स हॉस्पिटल","टैगोर नगर, ग्वालियर","24 Hours",
                 "ग्वालियर में, एपेक्स हॉस्पिटल रोगी देखभाल में मान्यता प्राप्त नाम है यह सिटी सेंटर में प्रसिद्ध निजी अस्पतालों में से एक है। रोगी देखभाल में सबसे अच्छी पेशकश करने और डेंगू बुखार उपचार, टीकाकरण / टीकाकरण, वायरल बुखार उपचार, गर्भावस्था में रोग, सामान्य बाल रोग और आदि जैसे तकनीकी दृष्टि से उन्नत स्वास्थ्य सुविधाओं से लैस दृष्टि के साथ समर्थित।","टैगोर नगर, अनुपम नगर, सरस्वती नगर, ग्वालियर, मध्य प्रदेश 474011","07512340910","gfjhgfjhdegj");
        adaptermedicalList.add(a);

        a = new Adaptermedical(covers[6],"बीआईएमआर अस्पताल","मोरार, ग्वालियर","08:00 A.M- 06:00 P.M",
                "बीआईएमआर अस्पताल कई सुविधाएं प्रदान करता है जैसे फार्मेसी, आईसीसीयू, एओयू के साथ नव-नतालल मध्यवर्ती वार्ड, एओयू के साथ पोस्ट ऑपरेटिव सर्जिकल वार्ड, एएचयू के साथ मेडिकल इंटरमीडिएट वार्ड, न्यूरो आई.सी.यू. और न्यूरो सर्जरी सेंटर, रक्त बैंक, सीटी। डिजिटल टेक्नोलॉजी, मोबाइल एक्स-रे, अल्ट्रासोनोग्राफी, एनएबीएल मान्यताप्राप्त प्रयोगशाला सेवाओं और आदि के साथ एक्स-रे (300 एमए) स्कैन करें।", "मोरार, ग्वालियर, मध्य प्रदेश 474005","07512405617","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[7],"आनंदपुर चैरिटेबल ","पुरानी छ्वानी, ग्वालियर","24 Hours",
                "दृष्टि के साथ समर्थित रोगी देखभाल में सर्वोत्तम प्रदान करने के लिए और तकनीकी रूप से उन्नत स्वास्थ्य सुविधाओं से सुसज्जित, वे स्वास्थ्य सेवा उद्योग में आने वाले नामों में से एक हैं। स्थित है, यह अस्पताल परिवहन के विभिन्न माध्यमों से आसानी से सुलभ है। अच्छी तरह प्रशिक्षित मेडिकल स्टाफ, गैर-चिकित्सा कर्मचारी और अनुभवी नैदानिक तकनीशियनों की एक टीम विभिन्न सेवाओं की पेशकश करने के लिए चौ-द-या-चौड़े काम करती है। उनकी पेशेवर सेवाओं ने उन्हें ग्वालियर में चैरिटेबल अस्पतालों के लिए मांग की। विशेषज्ञों सहित बोर्ड पर डॉक्टरों की एक टीम विभिन्न प्रकार के चिकित्सा मामलों से निपटने के लिए ज्ञान और विशेषज्ञता से लैस है।","एनएच 3, पुरानी छ्वानी, ग्वालियर पश्चिम, मध्य प्रदेश 474010","07512401200","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[8],"जया आरोग्य अस्पताल","Kampoo, ग्वालियर","24 Hours",
               "वर्तमान में अस्पताल की बिस्तर शक्ति लगभग 1200 बेड है। अस्पताल सभी आधुनिक उपकरणों से लैस है। यह न्यूरोसर्जरी, सर्पिल सीटी स्कैन और एमआर इमेजिंग सिस्टम, छाती के दर्द उपचार, क्लिनिकल कार्डियोलॉजी, हार्ट कंडीशंस, त्वचा रोग उपचार, टीबी में स्पेशलिटी डायग्नॉस्टिक्स, न्यूरोलॉजिकल कंडीशंस, नेत्र जांच जनरल, नेत्र शल्य चिकित्सा, अस्थि ट्रामा, फ्रैक्चर ट्रीटमेंट जैसे सुविधाएं प्रदान कर सकती हैं। और आदि।","जे ए अस्पताल परिसर, काम्पू ग्वालियर - 474001"," 07512403200","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[9],"आर.के.मेमोरियल अस्पताल","खेराप" +
                "ति रोड, ग्वालियर","24 Hours",
                "आरके मेमोरियल हार्ट हॉस्पिटल और मेडिकल केयर सेंटर, ग्वालियर, बहुमूल्य उपचार के लिए प्रसिद्ध अस्पताल में है। ग्वालियर में यह अस्पताल मरीज के इलाज के लिए बहुत सारे सुविधाएं प्रदान करता है जैसे कि एम्बुलेंस, आईसीयू / सामान्य बेड, फार्मेसी, कैंटीन, आदि। ऊपर की सुविधाओं के साथ , हॉस्पिटल कार्डियोलॉजी के लिए विशेष है। आरके मेमोरियल हार्ट हॉस्पिटल और मेडिकल केयर सेंटर में विशेषज्ञ विशेषज्ञ हैं, जो विभिन्न विशेषज्ञों के तहत अभ्यास कर रहे हैं।","रवि नगर, जीडीए ऑफिस के पीछे, खेड़ापति रोड, ग्वालियर, मध्य प्रदेश","07512630329","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[10],"सरकारी अस्पताल  ","तानसेन नगर, ग्वालियर","24 Hours",
                "ग्वालियर में, गोवरमेंट सिविल अस्पताल रोगी देखभाल में मान्यता प्राप्त नाम है। वे प्रसिद्ध अस्पतालों में से एक हैं दृष्टि के साथ समर्थित रोगी देखभाल में सर्वोत्तम प्रदान करने के लिए और तकनीकी रूप से उन्नत स्वास्थ्य सुविधाओं से सुसज्जित, वे स्वास्थ्य सेवा उद्योग में आने वाले नामों में से एक हैं। स्थित है, यह अस्पताल परिवहन के विभिन्न माध्यमों से आसानी से सुलभ है। अच्छी तरह प्रशिक्षित मेडिकल स्टाफ, गैर-चिकित्सा कर्मचारी और अनुभवी नैदानिक \u200B\u200Bतकनीशियनों की एक टीम विभिन्न सेवाओं की पेशकश करने के लिए चौ-द-या-चौड़े काम करती है। ग्वालियर में अस्पतालों के बाद उनकी पेशेवर सेवाओं ने उन्हें एक मांग की। विशेषज्ञों सहित बोर्ड पर डॉक्टरों की एक टीम विभिन्न प्रकार के चिकित्सा मामलों से निपटने के लिए ज्ञान और विशेषज्ञता से लैस है।","Unnamed रोड, तानसेन नगर, ग्वालियर, मध्य प्रदेश 474002","Not available","gfjhgfjhdegj");
        adaptermedicalList.add(a);


        a = new Adaptermedical(covers[11],"कमला राजे अस्पताल","लश्कर, ग्वालियर","24 Hours",
                "नई नैनोटॉलॉजी शाखा (नर्सरी) का गठन किया गया है और बाल चिकित्सा आईसीयू नवीनतम गजट के साथ है। इसमें गायनोकोलॉजी और प्रसूति के वार्ड, बच्चों के वार्ड, बच्चों के आईसीयू, बच्चों के शल्य चिकित्सा, वार्डोर्डोर्ड वार्ड, महिला शल्य चिकित्सा और जला वार्ड और महिला ईएनटी वार्ड शामिल हैं। वर्तमान में अस्पताल लगभग 450 बिस्तरों वाला है और बाल चिकित्सा विभाग, ए के तहत एक बाल चिकित्सा आईसीयू है। महिला के लिए जला वार्ड सर्जरी के विभाग के तहत मरीजों को जला और प्रसूति एवं गायनोकॉलॉजी विभाग के एक सोनोलाजी खंड।","जे। ए। अस्पताल परिसर, लश्कर, ग्वालियर, मध्य प्रदेश 474009","09425360494","gfjhgfjhdegj");
        adaptermedicalList.add(a);




    }
}
