package com.iiitm.android.zaika_e_gwalior;

import android.content.Context;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.support.v7.widget.Toolbar;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by Shivam on 12/19/2017.
 */

public class NearByPlacesHindiActivity extends AppCompatActivity {

    List<Adapternear> adapternearList = new ArrayList<>();
    Context mContext;
    MovieAdapternear movieAdapternear;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);
        Toolbar toolbar= (Toolbar)findViewById(R.id.toolbar);
        toolbar.setTitle("नजदीकी क्षेत्र ");


        RecyclerView recyclerView = (RecyclerView)findViewById(R.id.recyclerView);
        RecyclerView.LayoutManager layoutManager = new LinearLayoutManager(this);
        recyclerView.setLayoutManager(layoutManager);
        movieAdapternear = new MovieAdapternear(adapternearList,this);
        recyclerView.setAdapter(movieAdapternear);
        prepareMovieData();
    }

    private void prepareMovieData() {

        int[] covers = new int[]{
                R.drawable.td,
                R.drawable.orchha,
                R.drawable.mnp,
                R.drawable.skm,
                R.drawable.swf, R.drawable.chanderi, R.drawable.nsnactuary,



        };


        Adapternear a = new Adapternear(covers[0],"तिघरा बांध","Tighra, M.P","7A.M-7P.m",
                "तिघरा बांध ग्वालियर, मध्य प्रदेश, भारत से लगभग 23 किमी दूर, सिंक नदी पर एक मीठे पानी जलाशय बनाता है। शहर में पानी की आपूर्ति करने में यह महत्वपूर्ण भूमिका निभाता है\" + \"बाढ़ से पानी का उत्पादन मतिशील छिड़काव संयंत्र ग्वालियर तक\" + \" बांध 245 मीटर की ऊंचाई पर है और 1341 मीटर लंबा है। जलाशय में 4.8 मिलियन क्यूबिक मीटर की क्षमता है और स्पिलवे संरचना 1274 घन मीटर प्रति सेकेंड तक जा सकती है। 1 9 16 में इस साइट पर निर्मित एक बांध विफल हो गया 4 अगस्त, 1 9 17 की दोपहर, अपनी बलुआ पत्थर नींव में घुसपैठ की वजह से। लगभग 1000 लोग मारे गए थे।","तिघरा ग्वालियर 474001","नौकायन और पानी के स्कूटर","गर्मी का मौसम","Not Applicable");
        adapternearList.add(a);

        a = new Adapternear(covers[1],"ओरछा ","ओरछा , ग्वालियर","08:00 am - 08:00 pm",
                "ओरछा मध्य प्रदेश राज्य, भारत के टिकमगढ़ जिले में एक शहर है। यह शहर रुद्र प्रताप सिंह द्वारा 1501 के कुछ समय बाद स्थापित किया गया था, ये ग्वालियर से १२० किमी की दुरी पर है | ओरछा की नींव बुंदेला राजपूत सरदार रुद्र प्रताप ने डाली थी। ओरछा किला ओरछा का सबसे प्रसिद्ध किला है। इसका निर्माण भी सोलहवीं सदी में राजा रुद्र प्रताप सिंह ने शुरू करवाया था।  इस किले के अन्दर भवन और मंदिर भी है। राज महल और राम मंदिर की स्थापना राजा मधुरकर सिंह ने कराई थी, जिसने यहाँ वर्ष 1554 से 1591 तक राज किया था।","कंचनघाट, जिला टिकमगढ़, ओरछा, मध्य प्रदेश 472246","कैफे और रेस्टैरेंट सहित भारतीय, चानी और महाद्वीपीय","गर्मी का मौसम","Not Applicable");
        adapternearList.add(a);

        a = new Adapternear(covers[2],"माधव राष्ट्रीय उद्यान", "शिवपुरी, M.P.","06:00 am - 05:00 pm",
                "माधव राष्ट्रीय उद्यान उत्तर-मध्य मध्य प्रदेश, भारत के ग्वालियर क्षेत्र के शिवपुरी जिले में स्थित है। यह गढ़वाल के महाराजा, मराठों के सिंधिया वंश से संबंधित माधो राव सिंधिया के नाम पर स्थित है। यह अब्दुल खान की वंशावली है। , पंजाब में स्थित एक क्षेत्र है, और आधुनिक दिन न्यायशास्त्र को परिभाषित करने के लिए सामान्यतः श्रेय देने वाले कानूनों के लिए सबसे प्रसिद्ध है। शिवपुरी शहर 25 ° 40 'उत्तर में, 77 डिग्री 44' पूर्व में आगरा में बंबई राष्ट्रीय राजमार्ग 3 पर स्थित है। शिवपुरी ग्वालियर के सिंधिया शासकों की गर्मियों की राजधानी थी, जब अपने अतीत की शाही विरासत में घिरा हुआ है। इससे पहले इसके घने जंगल मुगल सम्राटों और मराठा रॉयल्स के शिकार के मैदान थे। साल 1564 में मंडु से लौटते समय सम्राट अकबर ने अपने अस्तबलों के लिए हाथियों के झुंड पर कब्जा कर लिया था|","शिवपुरी-झाशी रोड, एम.पी. 473551","नौका विहार, होटल और कैफे","शीतकालीन मौसम"," 15 Rs/व्यक्ति");
        adapternearList.add(a);

        a = new Adapternear(covers[3], "सतखंड महल ", "दतिया, M.P.","08:00 am- 11:00 pm",
                "दतिया पैलेस भी बीर सिंह पैलेस या बीर सिंह देव पैलेस के नाम से भी जाना जाता है, मध्य प्रदेश के ग्वालियर शहर से लगभग 75 किमी दूर स्थित है। इस महल की खासियत यह है कि यह 7 मंजिल की है.हालांकि शाही परिवार का कोई भी सदस्य यहां कभी नहीं रहा था। बुंदेलखंड में दतिया राज्य के संस्थापक- महाराज बिरसिंगघ देव देश भर के चारों ओर कई ऐसे 52 स्मारकों का निर्माण करते हैं। दतिया के पैलेस या सतखांडा पैलेस को दातिया महल भी कहा जाता है, साथ ही पुराना महल या \"पुराने महल\", इतिहासकार अब्दुल हमीद लाहौरी 1 9 नवंबर 1635 को शहान जहान के साथ इस शहर में आए थे। उन्होंने कहा कि महल लगभग 80 मीटर लंबे और यह भी बहुत व्यापक था। उन्होंने यह एक बहुत सुंदर और मजबूत महल के रूप में कहा।","दतिया-झाशी रोड, एम.पी.", "होटल और शॉपिंग", "किसी भी समय","Not Applicable");
        adapternearList.add(a);

        a = new Adapternear(covers[4],"सुल्तांगद झरना","शिवपुरी, M.P.","10:00 am - 06:00 pm",
                "इस क्षेत्र में मशहूर झरना सुल्तान गहरा झरना है। लोग इस क्षेत्र में प्रचलित हरियाली के कारण बरसात के मौसम में अक्सर इस जगह का दौरा करते हैं। आस-पास के क्षेत्र में विभिन्न रंगीन तितलियों की जमावट इस जगह को सुंदरता कहते हैं। सुल्तान गरह जलप्रपात शिवपुरी के पास एक आदर्श पिकनिक स्थान है, जो आम तौर पर मानसून के मौसम में जाता है। यह पार्वती नदी पर एक प्राकृतिक झरना है। लोग इस जगह का दौरा करने के लिए परिवार के साथ पूरे दिन बिताते हैं क्योंकि इसके मनोरम सौंदर्य और आसान स्थान है।","शिवपुरी, एम.पी. 475330", "बाइक राइडिंग", "शीतकालीन मौसम","Not Applicable");
        adapternearList.add(a);


            a = new Adapternear(covers[5],"चंदेरी","अशोकनगर, M.P.","10:00 am - 06:00 pm",
                  "चंदेरी, मालवा सुल्तानों और बुंदेला राजपूतों के समय से ही ऐतिहासिक महत्व का एक शहर है, जो 15 वीं और 16 वीं शताब्दी में इस क्षेत्र पर शासन किया। विदेशी पहाड़ियों, झीलों और जंगल से घिरा, यह आकर्षक गंतव्य चंदेरी सरस और ऐतिहासिक स्मारकों के लिए अविश्वसनीय रूप से प्रसिद्ध है जो कि हर साल इस स्थान पर बड़ी संख्या में पर्यटकों को आकर्षित करता है। इसके अलावा, महान जैन स्मारक और उनकी आकर्षक संस्कृति चंदेरी, मध्यप्रदेश में सबसे पसंदीदा पर्यटन स्थलों में से एक है। चंदेरी किले, चंदेरी संग्रहालय, जैन महलों, और अति सुंदर झीलों जैसे चंदेरी में पर्यटन को बढ़ावा देने वाली कई चीजें हैं।","अशोकनगर जिला, मध्य प्रदेश "," होटल और शॉपिंग "," अक्टूबर और अप्रैल के बीच सर्दियों ","Not Applicable");
        adapternearList.add(a);


        a = new Adapternear(covers[6], "चंबल अभयारण्य"," धौलपुर, राजस्थान","05:00 am - 07:00 pm",
                "यह वन्यजीव उत्साही लोगों के लिए एक आदर्श गंतव्य है। यह सबसे लुप्तप्राय प्रजातियों में से कुछ का निवास स्थान है, लेकिन मुख्य आकर्षण यहां हैं, घरिया, लाल ताजे ताजे कछुए, गंगा के डॉल्फिन, भारतीय स्कीमार्स, दूसरों के बीच में। सुंदर अभयारण्य चंबल नदी से घिरा हुआ है, जिसे एक भारत की स्वच्छ नदी यह आपको शहर के अराजकता से दूर एक अनोखी और असंपीठित आवास, प्रचुर वन्यजीव और अद्भुत परिदृश्य, मध्ययुगीन मंदिरों और शानदार प्राचीन खंडहर, पशु मेले और नागा साधुओं का एक संयोजन प्रदान करता है। पर्यटक आमतौर पर एक मोटर चालित नाव किराए पर लेते हैं और नदी के ऊपर जाकर नदी के किनारों में बहते हैं, जो एक शांत अनुभव के लिए बनाता है। नाविक पक्षियों और जानवरों के करीब के रूप में संभव के रूप में कुशल हैं उन्हें परेशान करने के लिए आपको दृष्टि सुंदर पशुओं की सुविधा का अवसर देने के लिए", "धौलपुर, राजस्थान", "जीप सफारी, यह राष्ट्रीय उद्यान नदी सफारी, साइकिल की सवारी, ऊंट सफारी प्रदान करता है।", "नवंबर-मार्च का दौरा करने का सबसे अच्छा समय है", "भारतीयों: 50INR, विदेशियों: 600INR");
        adapternearList.add(a);



    }
}
