package com.iiitm.android.gwalior_tourism.cardslidertry;

import android.animation.AnimatorSet;
import android.animation.ObjectAnimator;
import android.app.ActivityOptions;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Typeface;
import android.net.Uri;
import android.os.Build;
import android.os.Bundle;
import android.support.annotation.DrawableRes;
import android.support.annotation.StyleRes;
import android.support.v4.view.ViewCompat;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.CardView;
import android.support.v7.widget.RecyclerView;
import android.view.Gravity;
import android.view.View;
import android.view.ViewGroup.LayoutParams;
import android.view.ViewTreeObserver;
import android.widget.ImageSwitcher;
import android.widget.ImageView;
import android.widget.TextSwitcher;
import android.widget.TextView;
import android.widget.ViewSwitcher;

import com.iiitm.android.gwalior_tourism.HistoricalActivity;
import com.iiitm.android.gwalior_tourism.HotelActivity;
import com.iiitm.android.gwalior_tourism.MedicalActivity;
import com.iiitm.android.gwalior_tourism.NearbyActivity;
import com.iiitm.android.gwalior_tourism.R;
import com.iiitm.android.gwalior_tourism.WorshipActivity;
import com.iiitm.android.gwalior_tourism.cardslidertry.cards.SliderAdapter;
import com.iiitm.android.gwalior_tourism.cardslidertry.utils.DecodeBitmapTask;

import java.util.Random;



public class MainActivitySliderHindi extends AppCompatActivity {
    private final int[][] dotCoords = new int[27][2];

    int[] pics,maps;
    String[] descriptions, name, places, times, address, build, ticket, contact, timeVisit, fee, facilities;
    //String s=""+option1;
    //final SliderAdapter sliderAdapter = new SliderAdapter(pics, 28, new OnCardClickListener());
    SliderAdapter sliderAdapter;
    private CardSliderLayoutManager layoutManger;
    private RecyclerView recyclerView;
    private ImageSwitcher mapSwitcher;
    //private TextSwitcher temperatureSwitcher;
    private TextSwitcher placeSwitcher;
    private TextSwitcher clockSwitcher;
    private TextSwitcher descriptionsSwitcher;
    private View greenDot;

    private TextView country1TextView;
    private TextView country2TextView;
    private int countryOffset1;
    private int countryOffset2;
    private long countryAnimDuration;
    private int currentPosition;

    private DecodeBitmapTask decodeMapBitmapTask;
    private DecodeBitmapTask.Listener mapLoadListener;


    int select;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_slider);
        select = getIntent().getExtras().getInt("arg");

        if(select==0) {
            pics = new int[]{R.drawable.fort,
                    R.drawable.jaivilashpalace,
                    R.drawable.gopa,
                    R.drawable.mansingh,
                    R.drawable.sbt,
                    R.drawable.skund,
                    R.drawable.syndhiya,
                    R.drawable.gujrimus,
                    R.drawable.tombgauss, R.drawable.karan, R.drawable.jahagir, R.drawable.jauhar, R.drawable.moti,
                    R.drawable.bhimsinghrana, R.drawable.hamam,
                    R.drawable.vikram1, R.drawable.jhansikirani, R.drawable.jhilmil, R.drawable.pichor,
                    R.drawable.kila_behatt, R.drawable.atchatu,
                    R.drawable.mitawli, R.drawable.padavli, R.drawable.bateshwer,
                    R.drawable.dhume, R.drawable.behattt,
                    R.drawable.rasslela,
                    R.drawable.lathedi_gate};

            maps = new int[]{R.drawable.map_gwalior_fort, R.drawable.map_jai_vilas, R.drawable.map_gopachal, R.drawable.map_man_singh, R.drawable.map_saas_bahu, R.drawable.map_suraj_kund, R.drawable.map_scindia_museum, R.drawable.map_gujari_mahal, R.drawable.map_muhammad_ghaus, R.drawable.map_jahangir_mahal, R.drawable.map_karan_mahal, R.drawable.map_jauhar_kund, R.drawable.map_moti_mahal, R.drawable.map_hamam_khana, R.drawable.map_bheem_singh, R.drawable.map_vikram_mahal, R.drawable.map_rani_laxmi_cenotaph, R.drawable.map_jhilmileshwar, R.drawable.map_fort_of_pichor, R.drawable.thumbnail, R.drawable.map_chaturbhuj, R.drawable.map_mitawali, R.drawable.thumbnail, R.drawable.map_bateshawar, R.drawable.map_dhumeshwar, R.drawable.thumbnail, R.drawable.thumbnail, R.drawable.thumbnail};


            descriptions = new String[]{"एक बलुआ पत्थर पहाड़ी पर स्थित, यह तोमरों का प्रशासनिक मुख्यालय रहा है और कई राजवंशों के शासन के साक्षी है। 1857 के विद्रोह के दौरान, यह थोड़ी अवधि के लिए तांति टोपे और रानी लक्ष्मीबाई के नियंत्रण में था। लोकगीत कहते हैं। कि यह ऋषि ग्वालिप की सिफारिश पर राजा सूरज सेन द्वारा बनाया गया था। यह नीचे घाटी के मनोरम दृश्य पेश करता है। रास्ते पर चढ़ने के लिए, कोई व्यक्ति जैन थेरथंकरों की चट्टानों के चेहरे में नक्काशीदार मूर्तियों को देख सकता है। मैन मंदिर पैलेस में सोन-एट-लुमियर आपको देता है अपने गौरवशाली अतीत में एक झलक। किले का मुखौटा रंगों से चमकता है और एक शानदार अनुभव प्रदान करता है। "," जयविलास पैलेस का निर्माण 1874 में महाराजा जयजी राव सिंधिया ने 1 करोड़ रुपये की लागत से किया था। यह यूरोपीय वास्तुकला का एक अच्छा उदाहरण है। , सर माइकल फिलोज द्वारा डिजाइन और निर्मित, वास्तुशिल्प शैलियों का एक संयोजन, पहली मंजिल टस्कन, दूसरा इतालवी-डोरिक और तीसरा कुरिंथियन है। जय विलास महल का क्षेत्रफल 12,40,771 वर्ग फुट है और यह कण है अपने बड़े दरबार हॉल के लिए प्रसिद्ध है। दरबार हॉल के इंटीरियर को गिल्ट और सोना फर्निशिंग से सजाया गया है और एक विशाल कालीन और विशाल झूमर के साथ सजाया गया है। यह 100 फीट लंबा, 50 फीट चौड़ा और ऊंचाई में 41 फीट है। "," ग्वालियर विवाद में जाने के लिए दूसरी जगह गोपाचल पार्वत है। ग्वालियर में यह बहुत ही खूबसूरत जगह है। ग्वाचल पार्वत को ","येक पाथथर की बावरी के नाम से भी जाना जाता है, ग्वालियर में जाने के लिए एक अच्छी जगह है जैन तीर्थंकरों की बड़ी संख्या में मूर्तियां हैं। वे संख्या में 26 हैं। इन निर्माणों को 13 9 8 और 1536 की अवधि में तोमर शासकों, विशेष रूप से वीरम देव, दोंगार सिंह और कीर्ति सिंह को श्रेय दिया जाता है। ये मूर्तियां अहिंसा के संदेश को दुनिया में व्यक्त करती हैं और हिंदुओं को उनकी पूजा में बलिदान देने के लिए प्रचार करती हैं। जैन तेरथंकरों की ये विशाल मूर्तियां हर किसी को अंधविश्वासपूर्ण मान्यताओं और अनावश्यक जटिल अनुष्ठानों का पालन करने से रोकने के लिए प्रचार करती हैं। "," ग्वालियर, देश के महत्वपूर्ण ऐतिहासिक स्थलों में से एक में शानदार महलों और मैन सिंह पैलेस हैं, ग्वालियर उनमें से एक है जो वास्तव में देखने के लिए है। यह ग्वालियर किले के भीतर स्थित है। किला 3 किमी के क्षेत्र में फैलता है। ग्वालियर किले में छह महल, कई पानी के टैंक और तीन मंदिर हैं। किले कई उतार-चढ़ावों के साक्षी हैं और एक शासक से दूसरे शासक में चले गए हैं। प्रारंभ में टॉमर्स द्वारा शासित यह मुगलों, फिर मराठों, अंग्रेजों और अंत में सिंधियास "," सहस्त्र बहू या सास बहू मंदिर ग्वालियर किले परिसर के भीतर है। यह एक जुड़वां मंदिर है जो भगवान विष्णु को समर्पित है हजारों हथियारों के साथ भगवान (सहस्त्र बहू)। यह सबसे प्रभावशाली संरचना 32 * 32 मीटर है, जो राजा महिपाल की पत्नी के लिए बनाई गई थी जो भगवान विष्णु के भक्त थे, जो भगवान सूर्य को समर्पित एक छोटा सा है जो अपनी बहू के लिए बनाया गया था भगवान शिव के एक भक्त को सामूहिक रूप से सास-सास (सास) और बेटी-इन-लॉ (बहू) मंदिर कहा जाता था। "," सूरज कुंड ग्वालियर किले में स्थित एक टैंक है। कुंड का निर्माण 15 वीं शताब्दी में हुआ था, हालांकि इसका इतिहास 425 ईस्वी के शुरुआती दिनों में था। किंवदंती बताती है कि इस अवधि के दौरान सूरज सेन नाम का एक राजा शिकार के लिए जंगल में गया था और गायब था। राजा ने ऋषि ग्वालिप से पानी मांगे, जो जंगल में रहते थे। ऋषि ने उसे पानी के लिए एक पहाड़ी पर चढ़ने के लिए कहा। टैंक के पानी ने अपने कुष्ठ रोग को ठीक किया और ऋषि के प्रति कृतज्ञता के प्रतीक के रूप में, उन्होंने सूरज टैंक और एक मंदिर का निर्माण किया। स्थानीय लोग अभी भी मानते हैं कि टैंक में पानी औषधीय शक्ति है। टैंक के सुंदर परिवेश और ऐतिहासिक महत्व हर साल कई भक्तों और पर्यटकों को आकर्षित करते हैं। "," सिंधिया संग्रहालय जय विलास पैलेस का हिस्सा है, जिसे 1874 में ग्वालियर किले से कैदियों का उपयोग करके महाराजा जयजीराव द्वारा बनाया गया था। तब दोषी को हॉल कालीन बुनाई के 12 साल के नौकरी के साथ पुरस्कृत किया गया, जो एशिया में सबसे बड़ा है। महल में 400 कमरे हैं, जिनमें से विशेष रूप से 40 कमरे जिवाजी राव सिंधिया संग्रहालय में परिवर्तित हो जाते हैं ", "गुजर महल ग्वालियर के महलों में से एक है जिसे अब एक संग्रहालय में बदल दिया गया है। महल 15 वीं शताब्दी के दौरान राजा मन सिंह द्वारा उनकी पत्नी श्रीगणानी, एक गुजर राजकुमारी के लिए बनाया गया था। यह रानी की मांग पर बनाया गया था कि उसे नियमित रूप से पानी की आपूर्ति के साथ एक अलग महल की आवश्यकता थी। इसे पूरा करने के लिए, संरचना का निर्माण राय नदी के पास किया गया था। महल को 1 9 22 में एक संग्रहालय में परिवर्तित कर दिया गया था और केंद्रीय पुरातात्विक संग्रहालय के नाम से जाना जाता है "," शहर के पूर्व में मुहम्मद घास का मकबरा है। यह छोटे गुंबदों से निकलने वाले कोनों पर हेक्सागोनल टावरों के साथ एक वर्ग के रूप में बनाया गया है। भवन के शरीर को सभी तरफ से विस्तृत और नाजुक डिजाइन के नक्काशीदार पत्थर की जाली से घिरा हुआ है, जिसे पूरे बड़े गुंबद द्वारा ताज पहनाया जाता है जो एक बार नीली चमकदार टाइलों से घिरा हुआ था। शेख मोहम्मद घोस, जिसका शरीर भीतर स्थित है, सोलहवीं शताब्दी का एक प्रसिद्ध मुस्लिम संत था। "," तोमर राजपूत ने 11 9 4 एडी में ग्वालियर पर कब्जा कर लिया और विरामदेव, उद्धरण देव, विरामदेव, गणपतिदेव, दुगेरेन्द्र सिंह और कीर्ति सिंह द्वारा शासित। कर्ण महल कीर्ति सिंह की अवधि (1480-1486 एडी) के दौरान बनाया गया था। दो संग्रहीत महल वर्ग योजना पर बनाया गया था और एक तरफ 200 फीट मापा गया था। महल हिंदू वास्तुकला का सबसे अच्छा spaliman है। इसमें महल के तल पर हन्ना नाम की महिला स्नान की पूरी व्यवस्था है। ये दूसरी मंजिल और छतों पर जाने के लिए कदमों की उड़ान हैं। महल के अंदर बड़ा असेंबली हॉल है। "," महल के सामने महल स्थित है, जहां जहांगीर महल और शाहजहां महल अंदर हैं। बाद में मुगलों द्वारा जेल के रूप में उपयोग की जाने वाली एक उल्लेखनीय ऊंची दीवार वाली इमारत। जहांगीरी महल के रास्ते पर नौ अंधेरे कोशिकाएं और कहा जाता है कि शेर मंदिर के निर्माण के कारण शेर मंदिर के रूप में जाना जाता था और बाद में मुगल नियमों द्वारा पुनर्निर्मित किया गया जहांगीर और शाहजहां एक महल जहांगीरी महल ने मुगल वास्तुकला में 320 × 170 फीट मापा था शाहजहां द्वारा बनाया गया था। इसमें मुगल शैली की आकर्षक सजावट है। "," जगहों और मंदिर के अलावा, ग्वालियर किले के अंदर कई पानी के टैंक बनाए गए थे। सूरज कुंड, मैन सरोवर ताल, गंगोला ताल, एक खभताल, रानीताल, चेरिलल और जौहर कुंड हैं जो कि किले के अंदर रहने वाले लोगों के लिए पानी का मुख्य स्रोत थे। 1232 ईस्वी में इल्तुतमिस के हमले के समय राजपूत महिलाओं ने इस टैंक में सहयोग किया "," मोती महल 1827 ईस्वी में महाराजा जयजी रवि विज्ञान या ग्वालियर स्टेटी द्वारा निर्मित किया गया था। बड़े महल मोती महल को कमिश्नर ग्वालियर डिवीजन के कार्यालय में नियंत्रित किया गया है हॉल ऑफ कंट्रोल इंडिया, मीटिंग हॉल। रग्माला कमरे जो डिप्टी द्वारा संरक्षित हैं। एमपी का राज्य पुरातत्व। दशारा त्यौहार का एक समारोह दिखाते हुए सुंदर रग्माला चित्र हैं, बैठक कक्ष की दीवारों पर राधा-कृष्ण की आकर्षक पेंटिंग्स हैं। "," यह स्मारक ग्वालियर किले के पास के पश्चिमी प्रवेश द्वार के रैंपर्ट के गढ़ में स्थित है। पूर्व में इस हमाम खान में 3 मंजिल हैं। निचले तल में दो बेसमेंट हैं। पूरे हमम खान (बाथ-हॉल) में छह कमरे हैं जो एक दूसरे के साथ जुड़े हुए हैं। लोहे से बने बड़े स्नान टब को लकड़ी के पानी से गर्म पानी रखने के लिए मध्य कमरे में रखा जाता है। सभी कमरों में प्लास्टर पर जटिल डिजाइन के साथ उत्सुक मेहराब मेहराब हैं। सभी कमरों में प्लास्टर पर कमाना और सजावटी उत्कीर्णन। "," भीमसिंह राणा गोहाद के राजा जाट थे। 1754-1756 एडी के दौरान उन्हें ग्वालियर किले पर शासन किया गया था। मराठा के खिलाफ युद्ध में उनकी मृत्यु हो गई थी। ग्वालियर किले में जोहरकंद के पास जाट शासक बनाया गया यह सीनोटाफ था। भिमशिंग राणा सेनोटैफ 4 फीट ऊंची प्लेट फॉर्म और आकार द्वारा निर्मित वर्ग है। यह सीनोटाफ 3 कहानी है और सिखार सीनोताफ के शीर्ष पर बनाया गया है। "," तोमर वंश के महान राजा मानसिंह ने अपने बेटे विक्रमादित्य (1516-1523 ईस्वी) द्वारा सफलता प्राप्त की, जिन्होंने ग्वालियर पर करण महल के पीछे और योजना के पीछे और 212 फीट की एक तरफ शासन किया । पैलेस में बारह दरवाजे के साथ एक खुला वारांडा है, जिसे असेंबली हॉल के रूप में इस्तेमाल किया गया था। ऊपरी मंजिला जाने के लिए कदमों का एक झुकाव है। ",
                    "महारानी लक्ष्मी बाई कानपुर के पास बिथौर में पैदा हुए थे। उनकी शादी झांसी के राजा गंगधर राव के साथ हुई थी। वह गंगाधर रास की मौत के बाद झांसी के शासक बन गईं। वह झांसी की मौतानी लक्ष्मी बाई रानी से प्रसिद्ध थीं। पहला स्वतंत्र था 1 9 57 में वह ब्रिटिश सेना के खिलाफ लड़ाई कर रही थीं और उपन रेखा नदी के तट पर मृत्यु हो गई थी। इस शताब्दी में महारानी लक्ष्मी बाई के स्मारक द्वारा निर्मित किया गया था। "," इस जगह को तनय पांडे उर्फ ​​तानसेन का नाम घर कहा जाता है। किंवदंती जो तानसेन साइलेंस का इस्तेमाल करती है शिव मंदिर यहां बरगद के पेड़ के नीचे स्थित है। वर्तमान मंदिर को बाद की अवधि के कारण एक तरफ झुकाया गया था, भूस्खलन स्पष्ट है, यह छोटा मंदिर प्राचीन शिव मंदिर की जगह पर बाद की अवधि में बनाया गया था। निकटतम एल 0-एलविन शताब्दी ईस्वी। मुखी शिव लिंग, मत्राका बोर्ड, नंदी, भगवान विष्णु मूर्ति ब्याज, उमा महेश्वर, शिव मूर्ति ब्याज इत्यादि जैसे कलाकृतियों मौजूद हैं। शिव मंदिर की जगह पर एक सामना करने वाला लिंगम स्थापित किया गया, मंदिर तानसेन की पूजा करेगा और अभ्यास 15 वीं शताब्दी ईस्वी में ",
                    "मध्यकालीन काल से हमें मिलने के लिए अतीत के इतिहास का सबूत शुरू हो गया है। पिचोर का पुराना नाम  चंपा नागारी था जिसे वर्ष 1313 ईस्वी में तोमर और क्षत्रिय राजपूत राजाओं के बीच युद्ध में नष्ट कर दिया गया था। 1675 ईस्वी में , बुंदेला का राज्य इस क्षेत्र के राजवीर वृषभदेव सिंह द्वारा शासित था। वर्तमान में, किले के उत्तरी और पश्चिमी हिस्से का भी राजवीर बुंदेला ने बनाया था। बुंदेलस ने इस क्षेत्र पर लंबे समय तक शासन किया था, बाद में जाट राजाओं ने क्षेत्र को संभाला जाटों ने पिचोर के किले में कई किलों और किले का निर्माण किया था, जाटों ने भी महल और बाउडी का निर्माण किया था, जो जाट 1847 तक जारी रहता था। 1847 में, इस किले को ब्रिटिश और महाजदी सिंधिया ने पर्वत शेर द्वारा लिया था जट। माउंटेन सिंह के सैनिक सिंधिया की सेना में शामिल हो गए। 1852 ईस्वी में, यह क्षेत्र सरदार सरदार दिनकर राव के प्रभाव में था, और उन्होंने इसे एक तहसील बना दिया जो आजादी तक बना रहा। "," यह गढ़ मध्य में स्थित है महान गांव का। एक गहरी ट्रेक एच गढ़ी के निर्माण के समय के आसपास बनाया गया था, जिसके भीतर वर्ग बनाया गया था। खाई अभी भी सुरक्षित है। एक वर्ग अवधि में, फ़िरोज़ा नीचे के कक्षों की संरचना के साथ एक निश्चित अंतराल पर बनाया गया है। इन कमरों के पास, गुफा दीवार के शीर्ष तक पहुंचने के लिए बनाई गई है। गढ़ी में पूर्वी और दक्षिण में दो प्रवेश द्वार हैं। कंधे के भीतर तैयार किए जाने के लिए स्वास्तिका आकार के रास्ते में प्रवेश कर रहा है। वर्ग को तैयार किया गया प्रत्येक कोने पर फिर बुर्जो की संरचना है। इन जाट शासकों बुर्जो ने बंदूकें लागई को एक तोप रखा जो आज के उत्तर-पश्चिमी कोने के बुर्ज पर स्थित है। तैयार उत्तरी पक्ष में डिविंजिला आवासीय भवन थे जिनमें फ्रैक्टल है। केवल दीवारों को वर्तमान में तैयार किए जाने से संरक्षित किया जाता है। यार्ड बंद हो जाते हैं। किले का निर्माण 18 वीं शताब्दी ईस्वी में जाट शासक सीटीआरसीएन द्वारा गोहाद द्वारा बनाया गया था कि जाट बनाया गया था, जो मुख्यालय गोहाद की स्थिति में था। तैयार ऐतिहासिक और पुरातात्विक महत्वपूर्ण शर्तें। इसलिए, यह विभाग के अधीन ले जाने का प्रस्ताव है। "," चतुरभुज मंदिर भगवान विष्णु को समर्पित है और पूर्वी सड़क पर ग्वालियर किले के लिए स्थित है। ऐसा माना जाता है कि वर्ष 875 ईस्वी में प्रतिहारों की अवधि के दौरान नगरबट्टा के पोते ने बनाया था। इस मोनोलिथिक मंदिर पर कई संस्कृत शिलालेखों का उत्कीर्ण किया गया है। शिलालेख में शून्य का पहला रिकॉर्ड किया गया प्रतिनिधित्व है जहां इसे एक बिंदु के रूप में लिखा जाता है। ",
                    "चंबल नदी द्वारा पोषित, जिस पहाड़ी पर मितवाली मंदिर बैठता है वह पेड़ों के साथ हरा हरा है, और गोलाकार मंदिर का केवल एक चौथाई नीचे जमीन से दिखाई देता है। मंदिर में आकार का एक मुख्य मंदिर परिपत्र होता है जिसमें एक बड़ा झुकाव होता है केंद्रीय आंगन में खुलने वाले बाहरी परिसंचरण पथ से घिरा हुआ है। circumambulatory पथ में खंभे हैं जो साठ चार निकस या साठ चार छोटे मंदिरों में खुलते हैं, प्रत्येक आवास अब एक झुकाव है, लेकिन मूल रूप से योगिनीस की मूर्तियों को रखा गया था, जिससे मंदिर का नाम दिया गया था, चौंसाथ योगिनी मंदिर "," बेटेश्वर से कुछ किलोमीटर गढ़ी पद्वाली नामक एक किले के विशाल गढ़ हैं, जो संगमरमर शेर और शेरनी की एक जोड़ी से संरक्षित हैं। शेर मंदिर के चरणों की एक तेज उड़ान की रक्षा करते हैं जहां एक बार शासकों किले की पूजा की गई। भगवान शिव को समर्पित मंदिर का मुखमंद जटिल नक्काशी के साथ सजाया गया है लेकिन दुख की बात है कि मंडप या पवित्र अभयारण्य गड़गड़ाहट के ढेर से मर गया है। नक्काशी के कॉर्नुकोपिया बड़े पैमाने पर मुखमंदप की दीवारें जीवन से बड़े दिखते हैं। खंभे और लिंटेल के हर इंच पत्थर में बात करते हैं और लंबाई की न्यूनतम इकाई का भी एक अंश भी अनचाहे नहीं छोड़ा गया है "," मिताओली पद्वाली बनमोर, मोरेना, मध्य प्रदेश के पास "," बेटेश्वर केवल एक अकेला घर नहीं है मंदिर लेकिन मंदिर यहां एक विशाल जिग्स पहेली बनाते हैं, जिसमें इसके टुकड़े एक पहाड़ी ढलान के पच्चीस एकड़ से अधिक बिखरे हुए हैं। बेटेश्वर में दो सौ से अधिक मंदिर एक साथ पैक किए जाते हैं, कुछ खंडहर में, कुछ ने भारतीय पुरातत्व सर्वेक्षण द्वारा एक नया जीवन दिया। शिव और विष्णु को समर्पित, जिन्होंने खुद को सूर्यवंशी या भगवान लक्ष्मण के वंशज माना! और दिलचस्प हिस्सा यह है कि मंदिरों को अलग-अलग समय अवधि से संबंधित अपने अलग-अलग वास्तुकला से अलग किया जा सकता है, कुछ फ्लैट छतों के साथ, जबकि दूसरा curvilinear shikhars के साथ। मंदिरों में से कई मंदिरों के साथ एक पवित्र अभयारण्य है। "," धूश्वर महादेव मंदिर दाबर बिहारबार रोड के 6 किमी दूर काराबाती गांव के दक्षिण में स्थित गांव में स्थित है। यह मंदिर 17 वीं शताब्दी एडी के दौरान बुंदेला रेजार वेरशिंग द्वारा बनाया गया था। इस शिव मंदिर का अनुबंध किया गया है, जिसमें बड़े प्लेट फॉर्म शिव लिंग को शिकार में लगाया गया है। यह मंदिर प्रारंभिक बुंदेला और राजपूत शैली का बढ़िया एक्साम्पल है। यह मंदिर भवनों के निर्माण कार्यों और ऐतिहासिक और पुरातात्विक veiw के बहुत महत्व का एक अच्छा उदाहरण है। "," यह किला गांव के दक्षिण में एक उच्च पहाड़ी कोक में स्थित है कि किले के मुख्य द्वार का व्यवहार दक्षिण की ओर था लेकिन वर्तमान किले में वर्तमान किला नहीं था । 16 वीं शताब्दी में बस्तान और अन्य भाग का निर्माण किया गया था। एडी आवासीय अभयारण्य किले में मौजूद था, गोध के सभी नष्ट जाट शासक को 18 वीं शताब्दी में एडी और फिर से काम करने के लिए मुख्य तिमाही बनाया गया था। किला एक अदालत या दरार हॉल किले में जाट राजा चटर्सिंग द्वारा बनाया गया है। अदालत या दरवार हॉल सैक्ट्यूचर आयताकार है। दरबार हॉल कोर्ट और दीवान-ए-आम के रूप में हिस्से का उपयोग। "," यह स्मारक ग्वालियर के बरई गांव में स्थित है। ग्वालियर शहर से 30 किमी दूर शिवपुरी राजमार्ग। यह शानदार स्मारक महाराजा मानसिंह द्वारा 1486-1516 एडी के दौरान हमारी सत्तारूढ़ अवधि को टारमर द्वारा बनाया गया है। यह स्मारक मध्य में खुले अम्फी वेटर स्तंभ आधारित थाइटर का प्रारंभिक रूप है और स्टीयर पूरे चारों ओर बनाया गया है। कमरे मिंगेट के दो तरफ से बनाया गया था। यह स्मारक मलबे पत्थर और नींबू मोर्टार और पीरलेस suctctre द्वारा बनाया गया है। यह स्मारक ऐतिहासिक और पुरातात्विक veiw का महत्व है। रासलेला घर की चार तरफ दर्शकों की छत थी। "," लाधेरी या लद्देदी गेट अयोध्या के प्रशासक लद्दाखन द्वारा बनाया गया था। "+
                    "बाद में, मन सिंह तोमर ने मुस्लिम शासकों के प्रवास के लिए 15-16 वीं शताब्दी एडी में एक सराई का निर्माण किया। जौनपुर के शासक हुसैनशाह शंकी यहां रहे। \n" +
                    "यहां एक मस्जिद भी मौजूद थी। अब केवल द्वार जीवित है।", "ग्वालियर (मध्य प्रदेश)", "लद्देदी गेट अयोध्या के प्रशासक लद्दाखन द्वारा बनाया गया था।"};

            name = new String[]{"ग्वालियर किला", "जय विलास पैलेश", "गोपाचल पर्वत", "मानसिंह महल", "सहस्त्र बाहु मंदिर", "सुरजकुण्ड", "सिंधिया म्यूजियम", "गुजरी महल म्यूजियम", "मोहम्मद गौस का मकबरा", "कर्ण महल", "जहांगीर-शाहजहाँ महल", "जौहर कुंड", "Mमोतीमहल", "हमाम खाणा गढ", "भीम सिंह राणा छत्री", "विक्रम मंदिर महल", "रानी लक्ष्मी बाई की छत्री", "झिलमिलेष्वर महादेव मंदिर", "किला पिछोर बावड़ी", "गढ़ी बेहट", "चतुर्भुज मंदिर", "ितावली मंदिर", "पढ़ावली मंदिर", "बटेश्वर मंदिर", "धुमेस्वर मंदिर", "किला बेहत", "रासलीला घर", "लाधेड़ी गेट"};

            places = new String[]{"ग्वालियर (एमपी।)", "लश्कर, ग्वालियर", "लश्कर, ग्वालियर", "मिताओली, ग्वालियर", "स्वर्ग का मंदिर", "एजियन सागर"};
            // private final String[] temperatures = {"21°C", "19°C", "17°C", "23°C", "20°C"};

            times = new String[]{"09:00 पूर्वाह्न- 06:00 बजे", "10:00 पूर्वाह्न - 4:45 बजे", "10:00 पूर्वाह्न - 07:00 बजे", "09:30 पूर्वाह्न -05: 30 बजे", " 05:00 पूर्वाह्न- 09:00 बजे "," 08:00 पूर्वाह्न - 06:00 बजे "," 10:00 पूर्वाह्न-05:00 बजे "," 10:00 पूर्वाह्न-05:00 बजे "," 09: 00 पूर्वाह्न- 06:00 बजे "," 09:00 पूर्वाह्न- 06:00 बजे "," 09:00 पूर्वाह्न- 06:00 बजे "," 09:00 पूर्वाह्न- 06:00 बजे "," 09:00 बजे - 06:00 बजे "};

            address = new String[]{"ग्वालियर किला, ग्वालियर, मध्य प्रदेश, 474001, भारत",
                    "जय विलास पैलेस, ग्वालियर 474001",
                    "लश्कर, ग्वालियर, मध्य प्रदेश 474002", "पुरातत्व संग्रहालय फोर्ट कैंपस के पास, ग्वालियर 474001", "डाकघर के पास किला परिसर, ग्वालियर 474001", "ग्वालियर किला परिसर, ग्वालियर 474001", "जयविलास पैलेस, लश्कर, ग्वालियर, मध्य प्रदेश, 474009 ",
                    "लोहामंडी, ग्वालियर, मध्य प्रदेश 474008", "तानसेन रद, तानसेन नगर, ग्वालियर, मध्य प्रदेश 474002 "," ग्वालियर किला, ग्वालियर, मध्य प्रदेश, 474001 "," ग्वालियर किला, ग्वालियर, मध्य प्रदेश, 474001 ", "ग्वालियर किला, ग्वालियर, मध्य प्रदेश, 474001", "मोती महल रद, लश्कर, ग्वालियर, मध्य प्रदेश 474007", "ग्वालियर फोर्ट, ग्वालियर, मध्य प्रदेश, 474001", "ग्वालियर किला, ग्वालियर, मध्य प्रदेश, 474001", "ग्वालियर किला, ग्वालियर, मध्य प्रदेश, 474001", "ग्वालियर किला, ग्वालियर, मध्य प्रदेश, 474001", "दबरा ग्वालियर (एमपी) 474001", "दबरा, ग्वालियर ( एमपी) 474001 "," दबरा, ग्वालियर (एमपी) 474001", "ग्राम भत डिस्ट्रिक्ट, ग्वालियर(म.प.) 474001", "किला गेट रोड, राज मंडी, लोहामंडी, ग्वालियर, मध्य प्रदेश 474008", " मितौली, मध्य प्रदेश 476444"," नियर मितावली पदावली बानमोर, मोरेना, मध्य प्रदेश", " नियर मितावली पदावली बानमोर, मोरेना, मध्य प्रदेश", " धूमेश्वर, मध्य प्रदेश 475220", " बेहट रोड,ग्वालियर मध्य प्रदेश", " बारे, ग्वालियर, मध्य प्रदेश", "ग्वालियर(मध्य प्रदेश)"};

            build = new String[]{"महाराजा मानसिंह द्वारा 8 वीं शताब्दी", "वर्ष 1874 में महाराजा जयजीराव सिंधिया द्वारा", "तोमर किंग्स - वीरमदेव, डुंगर सिंह और कीर्ति सिंह के शासनकाल के दौरान बनाया गया", "1486 और 1516 के बीच तोमर शासक मन सिंह द्वारा निर्मित" , "कच्छपघाता राजवंश के राजा महिपाल द्वारा 10 9 2 में निर्मित", "15 वीं शताब्दी में सूरज सेन नामक राजकुमार की याद में निर्मित", "ग्वालियर किले से कैदियों का उपयोग करते हुए महाराजा जयजीराव द्वारा निर्मित", "यह मंसिंगह के दौरान बनाया गया था नियम "," बाबर द्वारा उनकी सहायता की गई जब उन्होंने 1526 में ग्वालियर के किले पर विजय प्राप्त की। "," 1480-1486 एडी की अवधि के दौरान क्रिटी सिंह द्वारा "," शेरशाह द्वारा निर्मित और बाद में मुगल ने जहांगीर और शाहजहां के नियमों का पालन किया। "," बाबुर ने 1526 में ग्वालियर के किले पर विजय प्राप्त की थी। "," 1827 ईस्वी में महाराजा जयजी रवि विज्ञान द्वारा निर्मित "," 15 वीं शताब्दी ईस्वी में तोमर राजा करण सिंह द्वारा "," जाट शासक द्वारा निर्मित ग्वालियर किले में जोहरकुंड "," मन सिंह तोमर (1516-1523 ईस्वी) के पुत्र विक्रमादित्य द्वारा निर्मित", "महारानी के स्मारक में निर्मित लक्ष्मी बाई। "," यह छोटा मंदिर प्राचीन काल में शिव मंदिर की जगह पर बनाया गया है। "," जाट महल और बावड़ी पिचोर के किले में निर्मित "," \n "+" \n "+" गहराई से बनाया गया था इमारत के चारों ओर खंभे निर्मित वर्ग के कंगन के भीतर तैयार की गई थी। "," \n "+" \n "+" ऐसा माना जाता था कि वर्ष 875 ईस्वी में, नगरवत्रा के पोते प्रहारों के दौरान बनाया जाना था। "," यह मंदिर कच्छपघाता राजा देवपाला द्वारा बनाया गया था "," यह मंदिर 10 वीं शताब्दी ईस्वी के प्रतिहार वंश द्वारा बनाया गया था "," यह प्रतिहार वंश द्वारा बनाया गया था। "," यह मंदिर 17 वीं शताब्दी ईस्वी के दौरान बुंदेला शासक वार्निशिंग द्वारा बनाया गया था। "," किला या दरवार हॉल जाट राजा चतुरसिंह द्वारा बनाया गया है "," यह स्मारक मलबे के पत्थर और नींबू मोर्टार और पीरलेस सक्सेक्ट्रे द्वारा बनाया गया है "," लद्देदी गेट अयोध्या के प्रशासक लद्दाखन द्वारा बनाया गया था। "};
            ticket = new String[]{"चाइल्ड -40 रुपये / व्यक्ति, वयस्क -75 रुपये / व्यक्ति", "60 रुपये / व्यक्ति", "बाल -40 रुपये / व्यक्ति, वयस्क -75 रुपये / व्यक्ति, विदेशी-250 रुपये / व्यक्ति", "100 रुपये / व्यक्ति "," 50 रुपये / व्यक्ति "," बाल -40 रुपये / व्यक्ति, वयस्क -75 रुपये / व्यक्ति, विदेशी-250 रुपये / व्यक्ति "," 100 रुपये / व्यक्ति "," प्रति व्यक्ति \n "+" कैमरा के लिए 50 "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है "," उपलब्ध नहीं है ", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है"};

            contact = new String[]{"75140407777", "9301107666", "0751 243 3400", "18002337777", "9781576646", "7514040777", "7512372390", "08 9 85869526", "7512234557", "075140407777", "075140407777", "075140407777", "07512424125", "75140407777", "075140407777", "075140407777", "075140407777", "075140407777", "757540407777", "075140407777", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "उपलब्ध नहीं है", "नहीं उपलब्ध ", " उपलब्ध नहीं है ", " उपलब्ध नहीं है ", " उपलब्ध नहीं है "};

            sliderAdapter = new SliderAdapter(pics, 28, new OnCardClickListener());
        }//historical
        if(select==1) {   pics = new int[]{
                R.drawable.at,
                R.drawable.gkehanuman,
                R.drawable.gupteshwer,
                R.drawable.gdbc,
                R.drawable.hkhawaza,
                R.drawable.smt,
                R.drawable.st,
                R.drawable.carthedral,
                R.drawable.sanichra};

            maps = new int[]{R.drawable.map_achaleshwar, R.drawable.map_gargaj, R.drawable.map_gupteshwar, R.drawable.map_guru_data, R.drawable.map_dargah_khwaja, R.drawable.map_shitla, R.drawable.map_sun, R.drawable.map_cathedral, R.drawable.map_shnichar};

            descriptions = new String[]{"श्री अख्लेश्वर मंदिर ग्वालियर में एक बहुत प्रसिद्ध मंदिर है, जहां लोग भगवान शिव और नंदी की पूजा करने के लिए आते हैं। नंदी को आमतौर पर एक बैल के रूप में चित्रित किया जाता है जो भगवान शिव के पर्वत के रूप में भी कार्य करता है। यह शहर के लोगों के बीच एक बहुत ही प्रसिद्ध मिथक है मंदिर के बारे में कि एक बार स्किंडिया शासक श्री माधोरो सिंधिया जी उस रास्ते पर सड़क का निर्माण कर रहे थे लेकिन शिवलिंग पहले भी रास्ते में रहते थे, सोचा था कि यह किसी भी चट्टान या कुछ है और वे लगातार उस चट्टान को हटाने की कोशिश कर रहे थे लेकिन फिर भी वे नहीं ढूंढ पाए उस चट्टान की गहराई और इसलिए महाराज एक बड़ी दुविधा में थे, और एक रात भगवान अचलनाथ स्वयं अपने सपने में प्रकट हुए और उनसे कहा कि वह जो चीज रॉक होने का अनुमान लगा रही है वह वास्तव में उसका रूप है और वह भक्तों को आशीर्वाद देने के लिए है। भगवान ने उसे आदेश दिया वहां एक महान मंदिर बनाने के लिए और अगले दिन शिवलिंग की पूजा शुरू हो गई और शहर के मध्य में अखलेश्वर मंदिर के रूप में मंदिर का निर्माण हुआ। ",

                    "भारतीय राज्य मध्य प्रदेश में ग्वालियर शहर प्राचीन काल में गलाव ऋषि का दंडनीय रहा है। इस सर्वोच्च पवित्र स्थान में, संकतमोखन सिद्ध का प्राचीन मंदिर श्री खेदापति जी हनुमान स्थित है। यहां से भक्तों का आगमन शुरू होता है 4 बजे हर रात, जो एक निर्बाध गति से चलता है। \n "+
                            "मंदिर श्री राम जानकी मंदिर, छोटे घर, श्री सिद्ध खेदापति हनुमान ट्रस्ट, ग्वालियर द्वारा चलाया जाता है। रामायण और सुंदर कंद का पाठ मंदिर में रखा जाता है। भक्तों द्वारा भक्तों को गरीबों को खिलाया जाता है। विशेष विद्युतीकरण और फूल व्यवस्था हनुमान जयंती के अवसर पर किया जाता है। श्री खेदपति जी को भगवान को चप्पान भोग की पेशकश की जाती है। ",

                    "गुप्तेश्वर मंदिर लोगों के बीच महान आध्यात्मिकता का केंद्र है। मंदिर वन के अंदर स्थित है। मंदिर में श्रवण के महीने के दौरान एक बड़ी भीड़ है जिसे भगवान शिव और अभिषेक कार्यक्रमों के महीने के रूप में जाना जाता है, पूरे दौरान वर्ष। मंदिर सड़क पर एक बड़ी पहाड़ी पर स्थित है जो तिघरा की ओर जाता है। शिवलिंग के साथ मां और भगवान राम-सीता का एक मंदिर है। इस जगह में भगवान शिव से जुड़ी बड़ी शुभकामनाएं हैं। ",

                    "गुरुद्वारा डेटा बांदी छोड 6 वें सिख गुरु, गुरु हरगोबिंद साहिब की स्मृति में एक स्मारक बनाया गया है। इतिहास में कहा गया है कि गुरु हरगोबिंद साहिब को दो वर्षों से जहांगीर द्वारा परिसर में कैद किया गया था। गुरु की रिहाई के समय, 52 हिन्दू राजा भी चाहते थे, जो उनके साथी कैदी थे, रिहा किए जाने के लिए। ग्वालियर किले के अंदर बनाया गया, गुरुद्वारा का निर्माण 1 9 70 में हुआ था। संगमरमर और रंगीन रंगीन ग्लास बहिष्कारों से बना, गुरुद्वारा महत्वपूर्ण सिख तीर्थ स्थलों में से एक है और हर साल कई पर्यटकों द्वारा दौरा किया जाता है। जहांगीर ने निर्देश दिए कि जो भी गुरु का वस्त्र रखता है उसे मुक्त कर दिया जाएगा। इस घटना ने गुरु को डेटा बांदी छोड का खिताब अर्जित किया। ",

                    "दरगाह ख्वाजा कनून साहिब ख्वाजा कनून साहिब नागौरी की याद में बनाया गया था। वह मारवाड़ के निवासी थे और 1481 के दौरान ग्वालियर पहुंचे। उनका पूरा नाम साईंद साईंदुद्दीन कनून रहमत उल्लाह अली चिश्तीया था, जो दरगाह के गुंबद पर बना है माता-पिता की सेवा करने के लिए, बुजुर्गों का सम्मान करने और पवित्र और ईश्वरों का पालन करने के लिए उनके जीवन के प्रमुख सिद्धांत थे। \n "+
                            "ख्वाजा इस्माइल ने उन सभी स्वर्गीय ज्ञान और अंतर्दृष्टि के साथ खानून साहिब को आशीर्वाद दिया, जिसे उन्होंने स्वयं अपने पिता और अध्यापक से प्रभावित किया था। उन्होंने खानून साहिब को पहले एमेर जाने के लिए निर्देश दिया और फिर ग्वालियर में बसने के लिए भगवान के संदेश और सुसमाचार को फैलाने का निर्देश दिया। सत्य और धार्मिकता। ",

                    "शीतला माता मंदिर माता शीतला देवी को समर्पित एक मंदिर है",

                    "सूर्य मंदिर, जिसे सूर्य मंदिर भी कहा जाता है, उड़ीसा में कोणार्क के प्रसिद्ध सूर्य मंदिर की प्रतिकृति है। सूर्य भगवान को समर्पित, मंदिर मोरार के निवास के पास स्थित है, और यह क्षेत्र के तीर्थस्थल स्थानों में से एक है। मंदिर का निर्माण 1 9 88 में भारत के प्रसिद्ध उद्योगपति जीडी बिड़ला ने किया था। सूर्य मंदिर लाल रेत पत्थर और सफेद संगमरमर का उपयोग करके बनाया गया है। मंदिर के बाहरी हिस्से को लाल रेत पत्थर से सजाया गया है जबकि अंदरूनी एक आदर्श सफेद संगमरमर का काम प्रस्तुत करते हैं। मंदिर के बाहरी हिस्सों को विभिन्न हिंदू देवताओं को चित्रित करने वाली कई पत्थर नक्काशीदार छवियों से भी सजाया गया है। ",

                    "यह ग्वालियर में प्रसिद्ध चर्च स्थान है",

                    "एटी में पत्थर से बना शनीचारा मंदिर विशेष है, हालांकि यह बाहर से दिखाई नहीं देता है। इसमें लानी (वर्तमान में श्रीलंका) से लाए गए शनि की मूल काले मूर्ति है। इस बात का यह है कि शैनदेव को कैदी बनाया गया था राक्षस राजा रावण (लंका का राजा), हिंदू महाकाव्य रामायण में। मंदिर के स्थापित होने के बाद ही एटी का धूल वाला गांव अस्तित्व में आया था। इससे पहले यह केवल कुछ पेड़ों के साथ एक बंजर पहाड़ी थी। ",


            };

            name = new String[]{"अचलेश्वर टेम्पल", "गरगज के हनुमान", "गुप्तेश्वर टेम्पल", "गुरुद्वारा दाता बंदी", "दरगाह ख्वाजा", "शीतला माता मंदिर", "सुन टेम्पल", "सत.जॉन कैथेड्रल", "शनिश्चरा टेम्पल"};
            places = new String[]{"ग्वालियर, एमपी", "बहादुर, ग्वालियर", "तिघरा रोड, ग्वालियर", "ग्वालियर किला, ग्वालियर", "ग्वालियर किला के पास", "शिवाजी नगर, ग्वालियर", "बीआईएमआर के पास, ग्वालियर", "फलक बाज़ार, ग्वालियर "," एटी बरहवाली, ग्वालियर "};

            times = new String[]{"10:00 पूर्वाह्न - 06:00 बजे", "10:00 पूर्वाह्न - 06:00 बजे", "09:00 पूर्वाह्न - 08:00 बजे", "24 घंटे", "06:00 पूर्वाह्न 10:00 अपराह्न "," 10:00 पूर्वाह्न - 08:00 अपराह्न "," 8:00 पूर्वाह्न -5: 00 बजे "," 10:00 पूर्वाह्न -10: 00 बजे "," 10:00 पूर्वाह्न -10: 00 बजे "};

            address= new String[]{"ललितपुर कॉलोनी, लश्कर, ग्वालियर, मध्य प्रदेश 474009", "लक्ष्मी गंज, ग्वालियर, मध्य प्रदेश 474008", "तिघरा रोड, ग्वालियर, मध्य प्रदेश 475330","ग्वालियर किला, ग्वालियर", "ग्वालियर किले के नजदीक", "शिवाजी नगर, ग्वालियर", "मोरार, ग्वालियर एम.पी."," फालका बाजार, लश्कर, ग्वालियर, मध्य प्रदेश 474015"," आईटी बारहवाली, मध्य प्रदेश, ग्वालियर 476444"};

            sliderAdapter = new SliderAdapter(pics, 9, new OnCardClickListener());
        }//worship
        if(select==2) {pics = new int[]{
                R.drawable.td,
                R.drawable.orchha,
                R.drawable.mnp,
                R.drawable.skm,
                R.drawable.swf,
                R.drawable.chanderi,
                R.drawable.nsnactuary
        };
            maps = new int[]{R.drawable.map_tghra, R.drawable.map_orcha, R.drawable.map_madhav, R.drawable.map_satkhand, R.drawable.map_sultan, R.drawable.map_chanderi, R.drawable.map_chambal};
            descriptions = new String[]{"टिग्रा बांध भारत के मध्य प्रदेश, ग्वालियर से लगभग 23 किमी दूर, सिंक नदी पर एक ताजे पानी के जलाशय का निर्माण करता है। यह शहर से पानी की आपूर्ति में महत्वपूर्ण भूमिका निभाता है" + "बांध से पानी उत्पादन आउटपुट मोतीलाल फिल्ट्रेशन प्लांट ग्वालियर" + " बांध इसकी छाती पर 24 मीटर ऊंचा है, और 1341 मीटर लंबा है। जलाशय में 4.8 मिलियन घन मीटर की क्षमता है और स्पिल्वे संरचना प्रति सेकंड 1274 क्यूबिक मीटर तक पहुंच सकती है। 1 9 16 में इस साइट पर निर्मित एक बांध विफल रहा 4 अगस्त, 1 9 17 की दोपहर, इसकी बलुआ पत्थर की नींव में घुसपैठ के कारण। लगभग 1000 लोगों को डाउनस्ट्रीम मारा गया। ",

                    "ओरछा किला बेटवा नदी पर द्वीप पर स्थित है। सुंदर स्थान के अलावा, किले के पास और अधिक प्रस्ताव हैं। इसमें कई महल और मंदिर हैं। यहां देखे जाने वाले तीन सबसे महत्वपूर्ण महल जहांगीर महल, राज महल और प्रसिद्ध राय परवीन महल हैं। जहांगीर महल अतीत में ओरछा में प्रचलित वास्तुकला की महिमा को दर्शाता है। महल में बहु-मंजिला बालकनी के विचार शानदार हैं। राज महल ओरछा किले के सबसे प्राचीन ऐतिहासिक स्मारकों में से एक है। ",

                    "माधव राष्ट्रीय उद्यान उत्तर-पश्चिम मध्य प्रदेश, भारत के ग्वालियर क्षेत्र के शिवपुरी जिले में स्थित है। इसका नाम मराठों के सिंधिया राजवंश से संबंधित ग्वालियर के महाराजा माधो राव सिंधिया के नाम पर रखा गया था। यह ÁAli की रेखा का पूर्वज घर है खान, पंजाब में स्थित एक क्षेत्र है, और आधुनिक दिवस न्यायशास्र को परिभाषित करने के लिए आमतौर पर श्रेय देने वाले कानूनों के लिए सबसे प्रसिद्ध है। शिवपुरी शहर 25 डिग्री 40 'उत्तर, 77 डिग्री 44' पूर्व में आगरा पर बॉम्बे राष्ट्रीय राजमार्ग -3 पर स्थित है। शिवपुरी ग्वालियर के सिंधिया शासकों की ग्रीष्मकालीन राजधानी थी, जब इसकी गहरी जंगलों में मुगल सम्राटों और मराठा रॉयल्स का शिकार मैदान था। सम्राट अकबर ने हाथ से हाथियों के झुंडों को अपने अस्तबल के लिए पकड़ा मंडु वर्ष 1564 में ",

                    "दतिया पैलेस जिसे बीर सिंह पैलेस या बीर सिंह देव पैलेस भी कहा जाता है, मध्य प्रदेश के ग्वालियर शहर से लगभग 75 किमी दूर स्थित है। इस महल की विशेषता यह है कि यह 7 मंजिल है। हालांकि शाही परिवार का न तो सदस्य यहां कभी रहता था बुंदेलखंड में दतिया राज्य के संस्थापक - महाराज बिरिसिंग देओ देश के चारों ओर ऐसे कई 52 स्मारकों का निर्माण करते हैं। दतिया के महल या सतखंदा पैलेस को दतिया महल, साथ ही पुराण महल या पुराना महल भी कहा जाता है। , इतिहासकार अब्दुल हामिद लाहोरी 1 9 नवंबर 1635 को शाहनजहां के साथ इस शहर आए। उन्होंने कहा कि महल लगभग 80 मीटर लंबा था और यह भी बहुत व्यापक था। उन्होंने इसे एक बहुत ही सुंदर और मजबूत महल के रूप में कहा। ",

                    "इस क्षेत्र में मस्तिष्ककारी झरना सुल्तान गढ़ झरना है। इस क्षेत्र में सुन्दर हरियाली के कारण लोग अक्सर बारिश के मौसम में इस जगह का दौरा करते हैं। आस-पास के क्षेत्र में विभिन्न रंगीन तितली की सभा इस जगह पर सुंदरता जोड़ती है। सुल्तान गढ़ फॉल्स शिवपुरी के पास एक आदर्श पिकनिक स्थान है, जिसे आमतौर पर मानसून के मौसम के दौरान देखा जाता है। यह पार्वती नदी पर एक प्राकृतिक झरना है। लोग इस मनोरंजक सुंदरता और आसान स्थान की वजह से परिवार के साथ पूरे दिन बिताते हैं। " ,

                    "चंदेरी मालवा सुल्तानों और बुंदेला राजपूतों के समय से ऐतिहासिक महत्व का एक शहर है, जिन्होंने 15 वीं और 16 वीं शताब्दी में इस क्षेत्र पर शासन किया था। विदेशी पहाड़ियों, झीलों और जंगल से घिरा यह आकर्षक गंतव्य चंदेरी साड़ियों और ऐतिहासिक के लिए अविश्वसनीय रूप से प्रसिद्ध है। स्मारक जो हर साल इस जगह पर बड़ी संख्या में पर्यटकों को आकर्षित करते हैं। इसके अलावा, महान जैन स्मारक और उनकी आकर्षक संस्कृति मध्य पारदेश में सबसे पसंदीदा पर्यटन स्थलों में से एक चंदेरी बनाती है। चंदेरी में चंदेरी जैसे पर्यटन को बढ़ावा देने वाली कई चीजें हैं , चंदेरी संग्रहालय, जैन महलों, और उत्तम झीलों। ",

                    "यह वन्यजीव उत्साही लोगों के लिए एक आदर्श गंतव्य है। यह कुछ सबसे लुप्तप्राय प्रजातियों का निवास स्थान है, लेकिन यहां मुख्य आकर्षण है, घरियल, रेड क्राउन कछुए, गंगा के डॉल्फिन, भारतीय स्कीमर्स, दूसरों के बीच। सुंदर अभयारण्य घिरा हुआ है चंबल नदी द्वारा, जिसे भारत की सबसे स्वच्छ नदी में से एक माना जाता है। यह आपको एक अद्वितीय और अप्रचलित आवास, प्रचुर मात्रा में वन्यजीवन और अद्भुत परिदृश्य, मध्ययुगीन मंदिरों और शानदार प्राचीन खंडहर, पशु मेले और नागा साधु का संयोजन प्रदान करता है, बहुत दूर शहर के अराजकता से। पर्यटक आमतौर पर एक मोटरसाइकिल वाली नाव किराए पर लेते हैं और नदी के ऊपर और नीचे जाते हैं क्योंकि यह एक शांत अनुभव के लिए बहती है। नावियों को परेशान किए बिना पक्षियों और जानवरों के करीब जितना संभव हो सके उन्हें आपको सुंदर जानवरों की सुविधाओं को देखने का मौका देने के लिए "
            };
            name = new String[]{"तिघरा बांध", "ओरछा", "माधव राष्ट्रीय उद्यान", "सतखंड महल", "सुल्तानगढ़ झरना", "चंदेरी", "चंबल अभयारण्य"};
            places = new String[]{"तिघरा,म.प.", "ओरछा,ग्वालियर", "शिवपुरी,म.प.", "दतिया,म.प.", "शिवपुरी,म.प", " अशोकनगर,म.प", " धौलपुर (राजस्थान)"};
            times = new String[]{"7 एएम-7 पीएम", "08:00 पूर्वाह्न - 08:00 अपराह्न", "06:00 पूर्वाह्न - 05:00 बजे", "08:00 पूर्वाह्न - 11:00 बजे", "10:00 हूँ - 06:00 बजे "," 10:00 पूर्वाह्न - 06:00 बजे "," 05:00 पूर्वाह्न - 07:00 बजे "};
            address= new String[]{"तिघरा,ग्वालियर 474001", "कंचनघाट, डिस्त्त. टीकमगढ़, ओरछा, मध्य प्रदेश 472246", "शिवपुरी-झांसी रोड,म.प 473551", "दतिया-झांसी रोड,म.प.", "शिवपुरी,म.प. 475330", " अशोकनगर डिस्ट्रिक्ट,मध्य प्रदेश", " धौलपुर ,मध्य प्रदेश"};
            facilities= new String[]{"नौकायन और पानी स्कूटर", "भारतीय, चीनी और महाद्वीपीय सहित कैफे और रेस्टॉरेंट", "नौकायन, होटल और कैफे", "होटल और खरीदारी", "बाइक राइडिंग", "होटल और खरीदारी", "जीप सफारी, यह राष्ट्रीय पार्क नदी सफारी, साइकिल की सवारी, ऊंट सफारी प्रदान करता है। "};
            timeVisit= new String[]{"ग्रीष्मकालीन मौसम "," ग्रीष्मकालीन मौसम "," शीतकालीन मौसम "," किसी भी समय "," शीतकालीन मौसम "," अक्टूबर और अप्रैल के बीच सर्दी "," नवंबर-मार्च यात्रा का सबसे अच्छा समय है। "};
            fee= new String[]{"लागू नहीं है", "लागू नहीं है", "15 आर / व्यक्ति", "लागू नहीं है", "लागू नहीं है", "लागू नहीं है", "भारतीय: 50INR, विदेशियों: 600INR"};
            sliderAdapter = new SliderAdapter(pics, 7, new OnCardClickListener());

        }//near
        if(select==3) {
            pics = new int[]{
                    R.drawable.royalinn,
                    R.drawable.grace,
                    R.drawable.regency,
                    R.drawable.lmark,
                    R.drawable.cpark,
                    R.drawable.shelter,
                    R.drawable.tanseeen,
                    R.drawable.ukiranplace,

            };
            maps = new int[]{R.drawable.map_royalinn, R.drawable.map_grace, R.drawable.map_regency, R.drawable.map_landmark, R.drawable.map_central, R.drawable.map_shelter, R.drawable.map_tansen, R.drawable.map_usha};
            descriptions = new String[]{"ग्वालियर के दिल में स्थित, होटल रॉयल इन, लोकप्रिय रेस्तरां के अलावा ग्वालियर के सबसे खूबसूरत भोज के हॉलों को होस्ट करता है ताकि मेहमानों की आतिथ्य की जरूरतों को पूरा किया जा सके और इससे अधिक हो सके। यह टेलीविजन कक्ष, जलवायु नियंत्रण, डेस्क, केबल  सैटेलाइट जैसी कई सुविधाएं प्रदान करता है। टीवी, एयर कंडीशनिंग रूम, चाइल्ड केयर, इंटरनेट एक्सेस, वेक अप कॉल, रीडिंग लैंप, रूम में बोतलबंद पानी, मुद्रा विनिमय, व्यापार सुविधाएं, विकलांग सुविधाएं, डॉक्टर ऑन कॉल, प्रदर्शनी स्थान, सम्मेलन हॉल, वेडिंग सेवाएं, बार, कॉफी शॉप  कैफे, सुरक्षा गार्ड। ", " ग्रेस होटल में विशाल कमरे हैं जो बालकनी के साथ पूर्ण वेंटिलेशन और प्राकृतिक वायु प्रदान करते हैं। कमरे की सुविधा में संलग्न स्नान, गर्म और ठंडा पानी, रेफ्रिजरेटर, केबल रंगीन टेलीविजन और डायरेक्ट डायल सेवा चलाना शामिल है। होटल सुविधाओं में घड़ी के दौरान कक्ष सेवा, कॉल पर डॉक्टर, यात्रा डेस्क, उसी दिन कपड़े धोने और जनरेटर का बैक अप। होटल सभी प्रमुख क्रेडिट कार्ड स्वीकार करता है। ", " ग्वालियर रीजेंसी होटल डब्ल्यू के लिए अनुकूल वातावरण सुनिश्चित करता है ओर्क और अवकाश। कक्ष सेवा, 24 घंटे का फ्रंट डेस्क, एयर कंडीशनिंग, लिफ्ट, कपड़े धोने, पार्किंग, यात्रा डेस्क और 24 घंटे की सुरक्षा बेसल सेवाएं हैं। व्यापार सुविधाओं के सेट में सम्मेलन सुविधाएं, व्यापार सेवाएं, ऑडियो विजुअल उपकरण, सम्मेलन सुइट, मीटिंग सुविधाएं और मीटिंग रूम शामिल हैं। मेहमान ब्लू फॉक्स, बहु-व्यंजन ऑनसाइट रेस्तरां में शानदार भारतीय, चीनी, मुगलई और कॉन्टिनेंटल व्यंजनों में शामिल होने का आनंद लेते हैं। ब्लैक कैडिलैक बार, संरक्षक को अंतरराष्ट्रीय विदेशी मादक पेय पेश करता है। ", " लैंडमार्क होटल, ग्वालियर विभिन्न व्यंजनों से व्यंजनों की एक रोमांचक श्रृंखला पेश करता है। डीलक्स, सुपर डीलक्स, सुइट और फ़ैमिली रूम मेहमानों को प्रदान किए जाने वाले आवास प्रकारों में चार प्रकार हैं। कमरे में उपलब्ध कुछ सुविधाएं एयर कंडीशनर, सोफा, टेलीविजन, चाय  कॉफी मेकर और मिनी फ्रिज हैं। नियमित सुविधाओं के अलावा संपत्ति में फ्रंट डेस्क, डॉक्टर ऑन कॉल, कपड़े धोने की सेवाएं, होटल व्यवसाय उद्देश्यों के लिए आदर्श है क्योंकि यह सम्मेलन सुविधाएं, व्यापार सेवाएं, ऑडियो विजुअल उपकरण, सम्मेलन सुइट और मीटिंग सुविधाएं प्रदान करता है। निस्संदेह यह ग्वालियर मध्य प्रदेश में सबसे अच्छे होटलों में से एक है। ", " सेंट्रल पार्क होटल आरामदायक और परेशानी रहित रहने के लिए आधुनिक सुविधाएं प्रदान करता है। प्राथमिक सेवाओं में रूम सर्विस, इंटरनेट का उपयोग, 24 घंटे का फ्रंट डेस्क, एयर कंडीशनिंग, लिफ्ट, पार्किंग, यात्रा डेस्क और 24 घंटे की सुरक्षा शामिल है। कॉरपोरेट मीटिंग्स और सम्मेलनों की व्यवस्था के लिए एक व्यापार केंद्र प्रदान किया जाता है। व्यापार केंद्र के अंदर सुविधाओं में सम्मेलन सुविधाएं, व्यापार सेवाएं, ऑडियो विजुअल उपकरण, एलसीडी  प्रोजेक्टर, सम्मेलन सुइट और मीटिंग सुविधाएं शामिल हैं। एक जिम, पूल, फूलों की दुकान और स्वास्थ्य क्लब पूर्ण कायाकल्प सुनिश्चित करता है। सामुदायिक सभाओं के लिए भोज सुविधाएं एक अतिरिक्त लाभ हैं। बहु-व्यंजन खाने के आउटलेट, कैफे रॉयल में एक स्वादिष्ट भोजन व्यवहार का आनंद लिया जा सकता है; कॉफी कॉम्प्लेक्स, रोज़बड और होटल कॉम्प्लेक्स के भीतर एक अच्छी तरह से स्टॉक बार। ", "होटल काम और अवकाश के लिए अनुकूल माहौल सुनिश्चित करता है। कक्ष सेवा, 24 घंटे का फ्रंट डेस्क, एयर कंडीशनिंग, लिफ्ट, कपड़े धोने, पार्किंग, यात्रा डेस्क और 24 घंटे की सुरक्षा बेसल सेवाएं हैं। व्यापार सुविधाओं के सेट में सम्मेलन सुविधाएं शामिल हैं , व्यापार सेवाएं, ऑडियो विजुअल उपकरण, सम्मेलन सुइट, मीटिंग सुविधाएं और मीटिंग रूम। मेहमानों को ब्लू फॉक्स, बहु-व्यंजन ऑनसाइट रेस्तरां में शानदार भारतीय, चीनी, मुगलई और कॉन्टिनेंटल व्यंजनों में शामिल होने का आनंद मिलता है। ब्लैक कैडिलैक बार, अंतर्राष्ट्रीय सेवा प्रदान करता है संरक्षकों के लिए विदेशी मादक पेय। ", "मेहमानों को सुविधाजनक और सुखद बनाने के लिए सुविधाओं की एक श्रृंखला की पेशकश की जाती है। मेहमानों को इंटरनेट, 24 घंटे का फ्रंट डेस्क, 24 घंटे रूम सर्विस, लिफ्ट, बेबी, बैठे, पार्किंग, यात्रा डेस्क, व्हील चेयर का उपयोग और 24 घंटे की सुरक्षा। व्यापार केंद्र, ऑडियो विजुअल उपकरण कॉर्पोरेट मेहमानों की जरूरतों को पूरा करते हैं। मेहमान स्वादिष्ट भोजन का आनंद ले सकते हैं और बढ़िया तरल का आनंद ले सकते हैं या क्रमशः इन-हाउस रेस्तरां और बार में पेश किया जाता है। कॉफी कॉफी में गर्म कॉफी और मोर्च लाइट स्नैक्स का एक सिप भी आनंद ले सकता है। ", " ताज उषा किरण पैलेस बालकनी और वाईफाई के उपयोग के साथ आवास प्रदान करता है। पूर्ण सेवा स्पा के साथ, इस होटल में एक रेस्तरां और आउटडोर है पूल। सार्वजनिक क्षेत्रों में नि: शुल्क वाईफाई और नि: शुल्क आत्म पार्किंग भी प्रदान की जाती है। इसके अतिरिक्त, एक फिटनेस सेंटर, एक कॉफी शॉप  कैफे, व्यापार सेवाएं, सम्मेलन सुइट, कॉकटेल लाउंज, मुफ्त समाचार पत्र, मीटिंग सुविधा, सम्मेलन कक्ष, जिम आदि। ",
            };


            name = new String[]{"रॉयल इन", "ग्रेस होटल", "ग्वालियर रीजेंसी होटल", "लैंडमार्क होटल", "सेंट्रल पार्क होटल", "होटल शेल्टर", "तानसेन रेजीडेंसी", "ताज उषा किरण प्लेस"};


            places = new String[]{"गांधी रोड, ग्वालियर", "गांधी रोड, ग्वालियर", "माणिक विलास कॉलोनी, ग्वालियर", "सिटी सेंटर, ग्वालियर", "तानसेन रोड, ग्वालियर", "थियिपुर, ग्वालियर", "लश्कर, ग्वालियर"};


            times = new String[]{"24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे"};


            address = new String[]{"रॉयल इन होटल, सिटी सेंटर रोड \n" +
                    "ग्वालियर, मध्य प्रदेश - 474011", "40, माणिक विलास कॉलोनी, गांधी रोड \n" +
                    "ग्वालियर, मध्य प्रदेश - 474002", "ग्वालियर रीजेंसी होटल, गांधी रोड \n" +
                    "ग्वालियर, मध्य प्रदेश - 474002", "47, माणिक विलास कॉलोनी, रेलवे स्टेशन के पास, ग्वालियर, मध्य प्रदेश 474002", "सिटी सेंटर, माधव राव स्किनडीए मार्ग, अपोजिट विशाल मेग्मार्त, पटेल नगर, ग्वालियर, मध्य प्रदेश 474001 ", " नियर रेलवे स्टेशन, तानसेन रोड, पड़ाव, ग्वालियर, मध्य प्रदेश 474002 ", " लनुपे कैंपस, थाटीपुर, ग्वालियर, मध्य प्रदेश 474002 ", "जयेन्द्रगंज लश्कर, ग्वालियर, मध्य प्रदेश 474009 "};


            contact = new String[]{"0751234 0892 ", "+918191900022 ", "+917417300033", "07514011271", " 07512232440", "07512376209", "07512340370", " 07512444000",};


            fee = new String[]{"स्टैंडर्ड रूम 2200 आईएनआर \n ड्यूलेक्स रूम 2700 आईएनआर \n एक्सक्लूसिव सूट रूम 5000 आईएनआर", "एसी ड्यूलेक्स रूम 1100 आईएनआर \n एक्स्टिवेटिव रूम 1450 आईएनआर  एन एसी सिट रूम 1 9 50 आईएनआर", "डुलेक्स रूम 3500 आईएनआर \n प्रेरक कक्ष 4800 INR \n ग्रैंड ड्यूलेक्स कक्ष 4800 आईएनआर ", " अधिकतम कक्ष दर: 4000 INR \n न्यूनतम कक्ष दर: 2500 INR ", " अधिकतम कक्ष दर: 7500 INR \n न्यूनतम कक्ष दर: 3500 INR ", " अधिकतम कक्ष दर: 6500 INR \n न्यूनतम कक्ष दर: 2200 INR ", " अधिकतम कक्ष दर: 3300 INR \n न्यूनतम कक्ष दर: 2300 INR ", " अधिकतम कक्ष दर: 38000 INR \n न्यूनतम कक्ष दर: 7000 INR "};

            sliderAdapter = new SliderAdapter(pics, 8, new OnCardClickListener());

        }//hotel
        if (select == 4) {
            pics = new int[]{
                    R.drawable.apoloh,
                    R.drawable.pariwarh,
                    R.drawable.navjeevanh,
                    R.drawable.kalyanmemorialh,
                    R.drawable.shaharah,
                    R.drawable.apex,
                    R.drawable.bimr,
                    R.drawable.charitbal, R.drawable.jaya, R.drawable.rkm, R.drawable.gcivilh, R.drawable.kamalraja,


            };
            maps = new int[]{R.drawable.map_apolo, R.drawable.map_pariwar, R.drawable.map_navjeevan, R.drawable.map_kalyan, R.drawable.map_sahara, R.drawable.map_apex, R.drawable.map_bimr, R.drawable.map_anandpur, R.drawable.map_jaya, R.drawable.map_rk, R.drawable.map_govern, R.drawable.map_kamla};
            descriptions = new String[]{"अपोलो अस्पताल कुछ नामों के लिए जनरल एंड लैप्रोस्कोपिक सर्जरी, ऑर्थोपेडिक एंड स्पाइन, गायनकोलॉजी, ओप्थाल्मोलॉजी सहित शल्य चिकित्सा विशेषताओं की विस्तृत श्रृंखला में उत्कृष्ट देखभाल प्रदान करता है। इसके अलावा, अस्पताल नेफ्रोलोजी, न्यूरोलॉजी, गैस्ट्रोएंटेरोलॉजी, कार्डियोलॉजी जैसे विशिष्टताओं में व्यापक चिकित्सा देखभाल प्रदान करता है। , डेंटल, त्वचाविज्ञान, प्लास्टिक और प्रसाधन सामग्री सर्जरी। ", " अपोलो अस्पताल कुछ नामों के लिए सामान्य और लैप्रोस्कोपिक सर्जरी, आर्थोपेडिक और रीढ़, स्त्री रोग, ओप्थाल्मोलॉजी सहित शल्य चिकित्सा विशेषताओं की विस्तृत श्रृंखला में उत्कृष्ट देखभाल प्रदान करता है। इसके अलावा, अस्पताल व्यापक प्रदान करता है नेफ्रोलोजी, न्यूरोलॉजी, गैस्ट्रोएंटेरोलॉजी, कार्डियोलॉजी, डेंटल, त्वचाविज्ञान, प्लास्टिक और प्रसाधन सामग्री सर्जरी जैसी विशेषताओं में चिकित्सा देखभाल। ", " ग्वालियर में, नवजीवन अस्पताल रोगी देखभाल में एक मान्यता प्राप्त नाम है। इसे वर्ष 2007 में अस्वीकार कर दिया गया था। वे एक हैं मोती महल रोड में जाने-माने निजी अस्पताल। रोगी देखभाल में सर्वोत्तम पेशकश करने और तकनीकी से लैस एक दृष्टि के साथ समर्थित केंद्रीय ऑक्सीजन आपूर्ति और मल्टीपारा मॉनीटर के साथ आईसीयू के रूप में उन्नत रूप से उन्नत स्वास्थ्य, शल्य चिकित्सा प्रक्रिया के लिए अल्ट्रा आधुनिक ऑपरेशन थिएटर, केंद्रीय ऑक्सीजन आपूर्ति और मल्टीपारा मॉनिटर के साथ आईसीयू, सर्जिकल प्रक्रिया के लिए अल्ट्रा आधुनिक ऑपरेशन थिएटर, डायलिसिस यूनिट, मेडिकल स्टोर, 24 घंटे आपातकालीन सुविधा, 24 एच हमारी एम्बुलेंस सेवा, कैशलेस और मेडिक्लेम बीमा सेवाएं, फिजियोथेरेपी इत्यादि। ", "कल्याण मेमोरियल और केडीजे अस्पताल ग्वालियर में एक असाधारण अस्पताल है। अस्पताल में 100 मशीनों की सुपर स्पेशलिटी सुविधा है जो नवीनतम मशीनों की पूरी श्रृंखला प्रदान करती है। इसमें पूरी तरह से सुसज्जित ऑर्थो और ट्रामा यूनिट, एक आपातकालीन विभाग और विभिन्न सुविधाओं के लिए आईसीसी है जो ड्यूटी समर्थित वेंटिलेटर, डिफिब्रिलेटर, मल्टीपार्मोनिटर और अन्य गंभीर देखभाल उपकरणों पर पोस्ट ग्रेजुएट डॉक्टरों के साथ सहायता करते हैं। ", "ग्वालियर में, सहारा अस्पताल एक है रोगी देखभाल में मान्यता प्राप्त नाम। इसे वर्ष 2000 में अस्वीकार कर दिया गया था। वे प्रसिद्ध अस्पतालों में से एक हैं। रोगी देखभाल में सर्वोत्तम पेशकश करने और तकनीकी रूप से उन्नत स्वास्थ्य सुविधाओं से लैस एक दृष्टि के साथ समर्थित, ", "ग्वालियर में, एपेक्स अस्पताल रोगी देखभाल में एक मान्यता प्राप्त नाम है। यह सिटी सेंटर के जाने-माने निजी अस्पतालों में से एक है। रोगी देखभाल में सर्वोत्तम पेशकश करने के लिए एक दृष्टि से समर्थित और तकनीकी रूप से उन्नत स्वास्थ्य सुविधाओं जैसे लैंगू बुखार से सुसज्जित उपचार, टीकाकरण / टीकाकरण, वायरल बुखार उपचार, गर्भावस्था में रोग, सामान्य बाल चिकित्सा और आदि ", " बीआईएमआर अस्पताल एएचयू के साथ फार्मेसी, आईसीसीयू, नियो-नेटाल इंटरमीडिएट वार्ड जैसी कई सुविधाएं प्रदान करता है, एएचयू के साथ पोस्ट ऑपरेटिव सर्जिकल वार्ड, मेडिकल इंटरमीडिएट एएचयू, न्यूरो आईसीयू और न्यूरो सर्जरी सेंटर, ब्लड बैंक, सीटी स्कैन, एक्स-रे (300 एमए) डिजिटल प्रौद्योगिकी, मोबाइल एक्स-रे, अल्ट्रासोनोग्राफी, एनएबीएल मान्यताप्राप्त प्रयोगशाला सेवाएं आदि के साथ वार्ड ", " एक दृष्टि के साथ समर्थित रोगी देखभाल में सर्वोत्तम पेशकश करें और तकनीकी रूप से उन्नत स्वास्थ्य सुविधाओं से सुसज्जित, वे हेल्थकेयर उद्योग में आगामी नामों में से एक हैं। इस अस्पताल में ट्रांसपो के विभिन्न साधनों से आसानी से पहुंचा जा सकता है। RT। अच्छी तरह से प्रशिक्षित चिकित्सा कर्मचारियों, गैर-चिकित्सा कर्मचारियों और अनुभवी नैदानिक ​​तकनीशियनों की एक टीम विभिन्न सेवाओं की पेशकश के लिए घूमती है। उनकी पेशेवर सेवाएं उन्हें ग्वालियर में चैरिटेबल अस्पतालों के बाद मांगी जाती हैं। विशेषज्ञों समेत बोर्ड पर डॉक्टरों की एक टीम विभिन्न प्रकार के चिकित्सा मामलों को संभालने के लिए ज्ञान और विशेषज्ञता से लैस है। ", " वर्तमान में अस्पताल की बिस्तर की ताकत लगभग 1200 बिस्तर है। अस्पताल सभी आधुनिक उपकरणों से लैस है। यह न्यूरोसर्जरी, सर्पिल सीटी स्कैन और एमआर इमेजिंग सिस्टम, चेस्ट पेन ट्रीटमेंट, क्लिनिकल कार्डियोलॉजी, हार्ट कंडीशंस, स्किन रोग उपचार, क्षय रोग में विशेषता निदान, न्यूरोलॉजिकल स्थितियां, आई चेकअप जनरल, आई सर्जरी, हड्डी आघात, फ्रैक्चर ट्रीटमेंट जैसी सुविधाएं प्रदान कर सकती है। और आदि।", "आरके मेमोरियल हार्ट अस्पताल और मेडिकल केयर सेंटर, ग्वालियर मूल्यवान उपचार के लिए प्रसिद्ध अस्पताल में से एक है। ग्वालियर में यह अस्पताल रोगी के उपचार जैसे एम्बुलेंस, आईसीयू / सामान्य बिस्तर, फार्मेसी, कैंटीन इत्यादि के लिए बहुत सी सुविधाएं प्रदान करता है। सुविधाएं, अस्पताल कार्डियोलॉजी के लिए विशिष्ट है। आरके मेमोरियल हार्ट अस्पताल और मेडिकल केयर सेंटर में विशेषज्ञ विशेषज्ञ हैं जो विभिन्न विशेषज्ञताओं के तहत अभ्यास कर रहे हैं। ", " ग्वालियर में, गोवर्टर सिविल अस्पताल रोगी देखभाल में एक मान्यता प्राप्त नाम है। वे प्रसिद्ध अस्पतालों में से एक हैं रोगी देखभाल में सर्वोत्तम पेशकश करने और तकनीकी रूप से उन्नत स्वास्थ्य सुविधाओं से लैस एक दृष्टि के साथ समर्थित, वे स्वास्थ्य देखभाल उद्योग के आने वाले नामों में से एक हैं। इस अस्पताल में परिवहन के विभिन्न साधनों से आसानी से पहुंचा जा सकता है। अच्छी तरह से एक टीम प्रशिक्षित चिकित्सा कर्मचारी, गैर-चिकित्सा कर्मचारी और अनुभवी नैदानिक ​​तकनीशियन विभिन्न सेवाओं की पेशकश के लिए घूमते हैं। उनकी पेशेवर सेवाएं उन्हें बनाती हैं ग्वालियर में अस्पतालों की मांग विशेषज्ञों समेत बोर्ड पर डॉक्टरों की एक टीम विभिन्न प्रकार के चिकित्सा मामलों को संभालने के लिए ज्ञान और विशेषज्ञता से लैस है। ", " नए नवजात विज्ञान विंग (नर्सरी) का गठन और नवीनतम राजपत्र के साथ बाल चिकित्सा आईसीयू भी है। इसमें स्त्री रोग और प्रसूति वार्ड, बच्चों के वार्ड, बच्चे आईसीयू, बच्चों को सर्जिकल वार्ड, मादा ऑर्थोपेडिक्स वार्ड, मादा सर्जिकल और जला वार्ड और मादा ईएनटी वार्ड है। वर्तमान में अस्पताल 450 बिस्तरों वाला है और बाल चिकित्सा विभाग, ए के तहत बाल चिकित्सा आईसीयू है। मादा के लिए वार्ड जलाएं सर्जरी विभाग के तहत रोगियों को जलाएं और ओबस्टेट्रिक्स और गायनकोलॉजी विभाग में एक सोनोलॉजी अनुभाग। "};

            name = new String[]{"अपोलो स्पेक्ट्रा", "पारिवार अस्पताल", "नवजीवन अस्पताल", "कल्याण अस्पताल", "शाहारा अस्पताल", "सर्वोच्च अस्पताल", "बीआईएमआर अस्पताल", "आनंदपुर चैरिटेबल", "जया आरोग्य अस्पताल", "आरके मेमोरियल अस्पताल ", " सरकारी अस्पताल "};

            places = new String[]{"लश्कर, ग्वालियर", "लश्कर, ग्वालियर", "मोती महल रोड, ग्वालियर", "लश्कर, ग्वालियर", "वसंत विहार, ग्वालियर", "टैगोर नगर, ग्वालियर", "मोरार, ग्वालियर", "पुरानी छवानी, ग्वालियर ", " कम्पा, ग्वालियर ", " खेरापति रोड, ग्वालियर ", " तानसेन नगर, ग्वालियर ", " लश्कर, ग्वालियर "};

            times = new String[]{"24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "8 पूर्वाह्न 6 बजे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे", "24 घंटे"};

            address = new String[]{"लश्कर, ग्वालियर, मध्य प्रदेश 474002 ", " लश्कर, ग्वालियर, मध्य प्रदेश 474001 ", " मोती महल रोड, ग्वालियर, मध्य प्रदेश 474002 ", " लश्कर, ग्वालियर -474001, अस्पताल सड़क ", " वसंत विहार, ग्वालियर, मध्य प्रदेश 474007 ", " टैगोर नगर, अनुपम नगर, सरस्वती नगर, ग्वालियर, मध्य प्रदेश 474011 ", " मोरार, ग्वालियर, मध्य प्रदेश 474005 ", " एनएच 3, पुरानी छवानी, ग्वालियर पश्चिम, मध्य प्रदेश 474010 ", " जेए अस्पताल कैंपस, कम्पा ग्वालियर - 474001 ", " रवि नगर, जीडीए ऑफिस, खेरापाटी रोड, ग्वालियर, मध्य प्रदेश के पीछे ", " अनाम सड़क, तानसेन नगर, ग्वालियर, मध्य प्रदेश 474002 ", " जेए अस्पताल कैंपस, लश्कर, ग्वालियर, मध्य प्रदेश 474009 "};

            contact = new String[]{"07512454600", "07514047000", "07514024081", "07514006700", "09926800870", "07512340910", "07512405617", "07512401200", " 07512403200", "07512630329", "उपलब्ध नहीं है", "09425360494"};

            sliderAdapter = new SliderAdapter(pics, 12, new OnCardClickListener());
        }//medical


        initRecyclerView();
        initCountryText();
        initSwitchers();
        initGreenDot();
        //hideNavigationBar();

    }

    @Override
    protected void onResume() {
        super.onResume();
        //hideNavigationBar();
    }


    private void hideNavigationBar() {
        this.getWindow().getDecorView().setSystemUiVisibility(View.SYSTEM_UI_FLAG_HIDE_NAVIGATION | View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY | View.SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN | View.SYSTEM_UI_FLAG_LAYOUT_HIDE_NAVIGATION | View.SYSTEM_UI_FLAG_LAYOUT_STABLE);
    }//medical

    private void initRecyclerView() {
        recyclerView = (RecyclerView) findViewById(R.id.recycler_view);
        recyclerView.setAdapter(sliderAdapter);
        recyclerView.setHasFixedSize(true);

        recyclerView.addOnScrollListener(new RecyclerView.OnScrollListener() {
            @Override
            public void onScrollStateChanged(RecyclerView recyclerView, int newState) {
                if (newState == RecyclerView.SCROLL_STATE_IDLE) {
                    onActiveCardChange();
                }
            }
        });

        layoutManger = (CardSliderLayoutManager) recyclerView.getLayoutManager();

        new CardSnapHelper().attachToRecyclerView(recyclerView);
    }

    @Override
    protected void onPause() {
        super.onPause();
        if (isFinishing() && decodeMapBitmapTask != null) {
            decodeMapBitmapTask.cancel(true);
        }
    }

    private void initSwitchers() {
//        temperatureSwitcher = (TextSwitcher) findViewById(R.id.ts_temperature);
//        temperatureSwitcher.setFactory(new TextViewFactory(R.style.TemperatureTextView, true));
//       temperatureSwitcher.setCurrentText(temperatures[0]);
//
//        temperatureSwitcher.setText("View More");

        placeSwitcher = (TextSwitcher) findViewById(R.id.ts_place);
        placeSwitcher.setFactory(new TextViewFactory(R.style.PlaceTextView, false));
        placeSwitcher.setCurrentText(places[0]);

        clockSwitcher = (TextSwitcher) findViewById(R.id.ts_clock);
        clockSwitcher.setFactory(new TextViewFactory(R.style.ClockTextView, false));
        clockSwitcher.setCurrentText(times[0]);

        descriptionsSwitcher = (TextSwitcher) findViewById(R.id.ts_description);
        descriptionsSwitcher.setInAnimation(this, android.R.anim.fade_in);
        descriptionsSwitcher.setOutAnimation(this, android.R.anim.fade_out);
        descriptionsSwitcher.setFactory(new TextViewFactory(R.style.DescriptionTextView, false));
        descriptionsSwitcher.setCurrentText(descriptions[0]);

        mapSwitcher = (ImageSwitcher) findViewById(R.id.ts_map);
        mapSwitcher.setInAnimation(this, R.anim.fade_in);
        mapSwitcher.setOutAnimation(this, R.anim.fade_out);
        mapSwitcher.setFactory(new ImageViewFactory());
        mapSwitcher.setImageResource(maps[0]);

        mapLoadListener = new DecodeBitmapTask.Listener() {
            @Override
            public void onPostExecuted(Bitmap bitmap) {
                ((ImageView)mapSwitcher.getNextView()).setImageBitmap(bitmap);
                mapSwitcher.showNext();
            }
        };
        mapSwitcher.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                final CardSliderLayoutManager lm =  (CardSliderLayoutManager) recyclerView.getLayoutManager();
                final int activeCardPosition = lm.getActiveCardPosition();
                String address1;
                // address="City Centre, Opp Tadon Kothi, Gole ka Mandir, Kalpi Road, Gwalior, Madhya Pradesh 474005";
                address1 = address[activeCardPosition%address.length];
                String url = "http://maps.google.com/maps?daddr="+address1;
                Intent intent = new Intent(android.content.Intent.ACTION_VIEW,  Uri.parse(url));
                startActivity(intent);
            }
        });

//        temperatureSwitcher.setOnClickListener(new View.OnClickListener() {
//            @Override
//            public void onClick(View view) {
//                Intent intent = new Intent(MainActivitySliderHistorical.this, HistoricalActivity.class);
//
//                intent.putExtra("imageView",pics[currentPosition]);
//                intent.putExtra("textView1",descriptions[currentPosition]);
//                intent.putExtra("textView2",places[currentPosition]);
//                intent.putExtra("textView3",places[currentPosition]);
//                intent.putExtra("textView4",);
//                intent.putExtra("textView5",adapter.getName8());
//                startActivity(intent);
//
//
//            }
//        });
    }

    private void initCountryText() {
        countryAnimDuration = getResources().getInteger(R.integer.labels_animation_duration);
        countryOffset1 = getResources().getDimensionPixelSize(R.dimen.left_offset);
        countryOffset2 = getResources().getDimensionPixelSize(R.dimen.card_width);
        country1TextView = (TextView) findViewById(R.id.tv_country_1);
        country2TextView = (TextView) findViewById(R.id.tv_country_2);

        country1TextView.setX(countryOffset1);
        country2TextView.setX(countryOffset2);
        country1TextView.setText(name[0]);
        country2TextView.setAlpha(0f);

        country1TextView.setTypeface(Typeface.createFromAsset(getAssets(), "open-sans-extrabold.ttf"));
        country2TextView.setTypeface(Typeface.createFromAsset(getAssets(), "open-sans-extrabold.ttf"));
    }

    private void initGreenDot() {
        mapSwitcher.getViewTreeObserver().addOnGlobalLayoutListener(new ViewTreeObserver.OnGlobalLayoutListener() {
            @Override
            public void onGlobalLayout() {
                mapSwitcher.getViewTreeObserver().removeOnGlobalLayoutListener(this);

                final int viewLeft = mapSwitcher.getLeft();
                final int viewTop = mapSwitcher.getTop() + mapSwitcher.getHeight() / 3;

                final int border = 100;
                final int xRange = Math.max(1, mapSwitcher.getWidth() - border * 2);
                final int yRange = Math.max(1, (mapSwitcher.getHeight() / 3) * 2 - border * 2);

                final Random rnd = new Random();

                for (int i = 0, cnt = dotCoords.length; i < cnt; i++) {
                    dotCoords[i][0] = viewLeft + border + rnd.nextInt(xRange);
                    dotCoords[i][1] = viewTop + border + rnd.nextInt(yRange);
                }

                greenDot = findViewById(R.id.green_dot);
                greenDot.setX(dotCoords[0][0]);
                greenDot.setY(dotCoords[0][1]);
            }
        });
    }

    private void setCountryText(String text, boolean left2right) {
        final TextView invisibleText;
        final TextView visibleText;
        if (country1TextView.getAlpha() > country2TextView.getAlpha()) {
            visibleText = country1TextView;
            invisibleText = country2TextView;
        } else {
            visibleText = country2TextView;
            invisibleText = country1TextView;
        }

        final int vOffset;
        if (left2right) {
            invisibleText.setX(0);
            vOffset = countryOffset2;
        } else {
            invisibleText.setX(countryOffset2);
            vOffset = 0;
        }

        invisibleText.setText(text);

        final ObjectAnimator iAlpha = ObjectAnimator.ofFloat(invisibleText, "alpha", 1f);
        final ObjectAnimator vAlpha = ObjectAnimator.ofFloat(visibleText, "alpha", 0f);
        final ObjectAnimator iX = ObjectAnimator.ofFloat(invisibleText, "x", countryOffset1);
        final ObjectAnimator vX = ObjectAnimator.ofFloat(visibleText, "x", vOffset);

        final AnimatorSet animSet = new AnimatorSet();
        animSet.playTogether(iAlpha, vAlpha, iX, vX);
        animSet.setDuration(countryAnimDuration);
        animSet.start();
    }

    private void onActiveCardChange() {
        final int pos = layoutManger.getActiveCardPosition();
        if (pos == RecyclerView.NO_POSITION || pos == currentPosition) {
            return;
        }

        onActiveCardChange(pos);
    }

    private void onActiveCardChange(int pos) {
        int animH[] = new int[] {R.anim.slide_in_right, R.anim.slide_out_left};
        int animV[] = new int[] {R.anim.slide_in_top, R.anim.slide_out_bottom};

        final boolean left2right = pos < currentPosition;
        if (left2right) {
            animH[0] = R.anim.slide_in_left;
            animH[1] = R.anim.slide_out_right;

            animV[0] = R.anim.slide_in_bottom;
            animV[1] = R.anim.slide_out_top;
        }

        setCountryText(name[pos % name.length], left2right);

//        temperatureSwitcher.setInAnimation(MainActivitySliderHistorical.this, animH[0]);
//        temperatureSwitcher.setOutAnimation(MainActivitySliderHistorical.this, animH[1]);
//        temperatureSwitcher.setText(temperatures[pos % temperatures.length]);

        placeSwitcher.setInAnimation(MainActivitySliderHindi.this, animV[0]);
        placeSwitcher.setOutAnimation(MainActivitySliderHindi.this, animV[1]);
        placeSwitcher.setText(places[pos % places.length]);

        clockSwitcher.setInAnimation(MainActivitySliderHindi.this, animV[0]);
        clockSwitcher.setOutAnimation(MainActivitySliderHindi.this, animV[1]);
        clockSwitcher.setText(times[pos % times.length]);

        descriptionsSwitcher.setText(descriptions[pos % descriptions.length]);

        showMap(maps[pos % maps.length]);

        ViewCompat.animate(greenDot)
                .translationX(dotCoords[pos % dotCoords.length][0])
                .translationY(dotCoords[pos % dotCoords.length][1])
                .start();

        currentPosition = pos;
    }

    private void showMap(@DrawableRes int resId) {
        if (decodeMapBitmapTask != null) {
            decodeMapBitmapTask.cancel(true);
        }

        final int w = mapSwitcher.getWidth();
        final int h = mapSwitcher.getHeight();

        decodeMapBitmapTask = new DecodeBitmapTask(getResources(), resId, w, h, mapLoadListener);
        decodeMapBitmapTask.execute();
    }

    private class TextViewFactory implements  ViewSwitcher.ViewFactory {

        @StyleRes final int styleId;
        final boolean center;

        TextViewFactory(@StyleRes int styleId, boolean center) {
            this.styleId = styleId;
            this.center = center;
        }

        @SuppressWarnings("deprecation")
        @Override
        public View makeView() {
            final TextView textView = new TextView(MainActivitySliderHindi.this);

            if (center) {
                textView.setGravity(Gravity.CENTER);
            }

            if (Build.VERSION.SDK_INT < Build.VERSION_CODES.M) {
                textView.setTextAppearance(MainActivitySliderHindi.this, styleId);
            } else {
                textView.setTextAppearance(styleId);
            }

            return textView;
        }

    }

    private class ImageViewFactory implements ViewSwitcher.ViewFactory {
        @Override
        public View makeView() {
            final ImageView imageView = new ImageView(MainActivitySliderHindi.this);
            imageView.setScaleType(ImageView.ScaleType.CENTER_CROP);

            final LayoutParams lp = new ImageSwitcher.LayoutParams(LayoutParams.MATCH_PARENT, LayoutParams.MATCH_PARENT);
            imageView.setLayoutParams(lp);

            return imageView;
        }
    }

    private class OnCardClickListener implements View.OnClickListener {
        @Override
        public void onClick(View view) {
            final CardSliderLayoutManager lm =  (CardSliderLayoutManager) recyclerView.getLayoutManager();

            if (lm.isSmoothScrolling()) {
                return;
            }

            final int activeCardPosition = lm.getActiveCardPosition();
            if (activeCardPosition == RecyclerView.NO_POSITION) {
                return;
            }

            final int clickedPosition = recyclerView.getChildAdapterPosition(view);
            if (clickedPosition == activeCardPosition) {
                Intent intent = null;
                if(select==0) { //historical
                    intent = new Intent(MainActivitySliderHindi.this, HistoricalActivity.class);
                    intent.putExtra("imageView", pics[activeCardPosition % pics.length]);
                    intent.putExtra("textView1", descriptions[activeCardPosition % descriptions.length]);
                    intent.putExtra("imageView1", maps[activeCardPosition % maps.length]);
                    intent.putExtra("textView2", address[activeCardPosition % address.length]);
                    intent.putExtra("textView3", build[activeCardPosition % build.length]);
                    intent.putExtra("textView4", ticket[activeCardPosition % ticket.length]);
                    intent.putExtra("textView5", contact[activeCardPosition % contact.length]);
                }
                if(select==3){ //hotel
                    intent = new Intent(MainActivitySliderHindi.this, HotelActivity.class);
                    intent.putExtra("imageView", pics[activeCardPosition % pics.length]);
                    intent.putExtra("textView1",descriptions[activeCardPosition%descriptions.length]);
                    intent.putExtra("imageView1", maps[activeCardPosition % maps.length]);
                    intent.putExtra("textView2",address[activeCardPosition%address.length]);
                    //intent.putExtra("textView3",facilities[activeCardPosition%facilities.length]);
                    intent.putExtra("textView4", contact[activeCardPosition % contact.length]);
                    intent.putExtra("textView3", fee[activeCardPosition % fee.length]);
                }
                if(select==2){ //near
                    intent = new Intent(MainActivitySliderHindi.this, NearbyActivity.class);
                    intent.putExtra("imageView", pics[activeCardPosition % pics.length]);
                    intent.putExtra("textView1",descriptions[activeCardPosition%descriptions.length]);
                    intent.putExtra("imageView1", maps[activeCardPosition % maps.length]);
                    intent.putExtra("textView2",address[activeCardPosition%address.length]);
                    intent.putExtra("textView3",facilities[activeCardPosition%facilities.length]);
                    intent.putExtra("textView4",timeVisit[activeCardPosition%timeVisit.length]);
                    intent.putExtra("textView5",fee[activeCardPosition%fee.length]);
                }
                if(select==1){ //worship
                    intent = new Intent(MainActivitySliderHindi.this, WorshipActivity.class);
                    intent.putExtra("imageView", pics[activeCardPosition % pics.length]);
                    intent.putExtra("textView1",descriptions[activeCardPosition%descriptions.length]);
                    intent.putExtra("imageView1", maps[activeCardPosition % maps.length]);
                    intent.putExtra("textView2",address[activeCardPosition%address.length]);
                }
                if(select==4){ //medical
                    intent = new Intent(MainActivitySliderHindi.this, MedicalActivity.class);
                    intent.putExtra("imageView", pics[activeCardPosition % pics.length]);
                    intent.putExtra("textView1",descriptions[activeCardPosition%descriptions.length]);
                    intent.putExtra("textView2", address[activeCardPosition % address.length]);
                    intent.putExtra("imageView2", maps[activeCardPosition % maps.length]);
                    intent.putExtra("textView3", contact[activeCardPosition % contact.length]);
                }
                if (Build.VERSION.SDK_INT <= Build.VERSION_CODES.LOLLIPOP) {
                    startActivity(intent);
                } else {
                    final CardView cardView = (CardView) view;
                    final View sharedView = cardView.getChildAt(cardView.getChildCount() - 1);
                    final ActivityOptions options = ActivityOptions
                            .makeSceneTransitionAnimation(MainActivitySliderHindi.this, sharedView, "shared");
                    startActivity(intent, options.toBundle());
                }
            } else if (clickedPosition > activeCardPosition) {
                recyclerView.smoothScrollToPosition(clickedPosition);
                onActiveCardChange(clickedPosition);
            }
        }
    }

}
